<?php

	if(!defined('IN_GAME')) exit('Access Denied');

	/********元素大师配置文件********/

	//过滤选项：
	//不可以被拆解的NPC类型
	$no_type_to_e_list = Array();
	//不可以被拆解的【道具】（关键词匹配）
	$no_itm_to_e_list = Array('提示紙條',);
	//不可以被拆解的【道具类别】
	$no_itmk_to_e_list = Array('N','WN','p','fy','ygo');
	//不可以被拆解的【道具属性】
	$no_itmsk_to_e_list = Array('v','^');
	//使用元素合成的道具自带灵魂绑定属性（启用：1）
	$no_emix_circulation = 0;
	//是否启用研究模式（启用：1）
	//TODO：研究模式：每局游戏初始化时，为元素随机分配不同的特征，为特征组合分配随机配方。
	//玩家需要通过阅读提示纸条，或合成出对应的类型/属性，才能了解到元素特征、组合配方，并显示在技能升级页面。
	//$enable_emix_research_mode = 0;

	/********拆解相关配置********/
	//定值：（顺序：优先判定全词匹配→之后判定关键词匹配）
	//拆解【特定道具】（全词匹配） 固定会获得的元素、数量
	$split_itm_fix = Array
	(
		/*** 秘钥分解 ***/
		//分解冰炎钥匙 获得 随机配方_2 的第 0,1 条素材
		'冰炎鑰匙·冰' => 'r_2-0',
		'冰炎鑰匙·炎' => 'r_2-1',
		//分解三女主歌词卡 获得 随机配方_3 的第 0,1,2 条素材
		'歌詞卡片【海洋】' => 'r_3-0',
		'歌詞卡片【大地】' => 'r_3-1',
		'歌詞卡片【星空】' => 'r_3-2',
		//分解黑色碎片、十字发卡 获得 随机配方_4 的第 0,1 条素材
		'黑色碎片' => 'r_4-0',
		'十字髮卡' => 'r_4-1',
		//分解琉璃血 获得随机配方_5 的第 1 条素材
		'琉璃血' => 'r_5-1',
		/** 会吐道具的分解 **/
		'安雅人體冰雕' => Array('spitm'=>Array('武器師安雅的獎賞','Y','1','1','')),
		/*** 道具分解 ***/
		'◆火之碎片' => Array(0=>77,1=>77,2=>77,3=>77,4=>77,5=>77), //全元素+77
		'白色方塊' => Array(0=>110), //昼闪闪+100
		'黑色方塊' => Array(5=>110), //夜静静+100
		'消音器' => Array(5=>22), //夜静静+22
		'打火機' => Array(1=>111), //暖洋洋+111
		'樹葉' => Array(3=>88), //郁萌萌+88
		'毒藥' => Array(5=>21), //夜静静+21
		'電池' => Array(0=>15,4=>17), //亮晶晶+15、昼闪闪+17
		'手機' => Array(0=>20,),
		'筆記本電腦' => Array(4=>20,),
		'バカ⑨製冰塊' => Array(2=>19,5=>21), //冷冰冰+19、夜静静+21
	);
	//拆解【特定道具】（关键词匹配，顺序越靠前优先级越高） 固定会获得的元素、数量
	$split_spitm_fix = Array
	(
		'寶石方塊' => 200, //随机元素+200
		'方塊' => 100, //随机元素+100
	);
	//拆解【特定类别NPC尸体】会获得的元素、数量
	$split_spcorpse_fix = Array
	(
		/*** 秘钥分解 ***/
		//分解种火尸体 获得 随机配方_0 的第 r(随机) 条素材
		92 => 'r_0-r',
		//分解执行官尸体 获得 随机配方_1 的第 0,1,2 条素材
		7 => Array('電擊使 御坂 美琴'=> 'r_1-0','班主任 坂持 金髮'=> 'r_1-1','花之領主 風見 幽香'=> 'r_1-2',),
		//分解武神尸体 获得随机配方_5 的第 0 条素材
		21 => 'r_5-0',
	);
	
	//系数：
	//拆解的对象等级与获得元素的数量关系（默认：等级*1） 什么，小兵竟然有30级！？
	$split_corpse_lvl_r = 1; 
	//任意【类别】对获取元素数量的系数修正（默认：0.8）（基础的元素数量：道具(效果+耐久)/2 *该系数）
	$split_default_itmk_r = 0.8;
	//指定【类别】对获取元素数量的系数修正
	$split_itmk_r = Array
	(
		//陷阱
		'T' => 0.3,
		//（*拆解复合武器 x1.5）
		'WGK' => 1.5,
		'WCF' => 1.5,
		'WCP' => 1.5,
		'WKF' => 1.5,
		'WKP' => 1.5,
		'WFK' => 1.5,
		'WDG' => 1.5,
		'WDF' => 1.5,
		'WJ'  => 1.2,
		'WB'  => 1.2,
		//补给品x0.05
		'HH' => 0.03,
		'HS' => 0.03,
		'HB' => 0.05,
		'PB2' => 0.035,	
		'PB' => 0.03,
		'PH' => 0.02,
		'PS' => 0.02,
		//药剂 x10
		'C' => 10,
		//强化药物……这也舍得拆？
		'ME'=> 18,
		'MH'=> 17,
		'M'=> 10,
		'V'=> 10,
		'VV'=> 15,
		//弹药……这也要拆！？
		'GBh' => 5,
		'GBr' => 0.003,
		'GBi' => 0.005,
		'GBe' => 0.005,
		'GB' => 0.004,	
	);
	//单个任意【属性】对标的元素数量（默认：50）
	$split_default_itmsk_fix = 50;
	//特定【属性】对标的元素数量
	$split_itmsk_fix = Array
	(
		//物理攻击：
		'R' => 11, //馄饨伤害
		'N' => 68, //冲击
		'n' => 89, //贯穿
		'y' => 90, //破格
		'r' => 144, //连击
		//属性攻击：
		'u' => 52, //火焰
		'i' => 34, //冻气
		'w' => 49, //音波
		'e' => 39, //带电
		'p' => 51, //带毒
		'd' => Array('default'=>77,'WD'=>22,'WDG'=>33,'WDF'=>33), //爆炸 出现在爆炸物上时降低价值
		'f' => 78, //灼焰
		'k' => 79, //冰华
		//物理防御类：14
		'P' => 14,
		'K' => 14,
		'C' => 14,
		'G' => 14,
		'F' => 14,
		'D' => 28, //防爆好！
		'A' => 101, //全系防御
		'B' => 1, //伤害抹消……
		//属性防御类：17
		'U' => 17,
		'E' => 17,
		'I' => 17,
		'W' => 17,
		'q' => 17,
		'a' => 89, //属性防御
		'b' => 1, //属性抹消
		//杂项：
		'M' => 33, //探雷
		'S' => 15, //消音
		'c' => 26, //重击辅助
		'H' => 42, //HP制御
		'h' => 1997, //伤害制御
		//？：
		'j' => 11, //多重
		'J' => 22, //超量素材 //我有一个想法 但是这里写不下了
		'o' => 66, //一发
		'z' => 77, //天然
		'x' => 777, //奇迹
		'Z' => 1, //菁英
	);

	/********合成相关配置********/
	//【特征】：每个元素带有若干个【主要特征】与【次要特征】。
	//【主要特征】：用于决定合成产物的【类别】，合成时【投入份数最多】的元素会显现其主要特征。投入单数份元素时提供【第一个主特征】，否则提供【第二个主特征】
	//【次要特征】：用于决定合成产物的【属性】。
	//元素特征预设模板（关闭研究模式的情况下，每局游戏内元素的特征依此模板固定。）
	$temp_etags = Array
	(
		//dom => 主要特征（类别）  sub => 次要特征（属性）  
		//max_d(s)_tags => 仅在研究模式开启的情况下生效，用于限定元素随机生成的标签上限
		0 => Array('dom' => Array('WD','DF'), 'sub' => Array('d','D','H','z'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //亮晶晶
		1 => Array('dom' => Array('WG','DA'), 'sub' => Array('u','G','U','c'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //暖洋洋
		2 => Array('dom' => Array('WC','DH'), 'sub' => Array('i','C','I','M'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //冷冰冰
		3 => Array('dom' => Array('WK','HS'), 'sub' => Array('p','K','q','H'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //郁萌萌
		4 => Array('dom' => Array('WP','HH'), 'sub' => Array('e','P','E','x'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //昼闪闪
		5 => Array('dom' => Array('WF','DB'), 'sub' => Array('w','F','W','S'), 'max_d_tags'=>2, 'max_s_tags'=>4,), //夜静静
	);
	$flip_d_tag = Array 
	(
	  'WD' => 0,
	  'DF' => 0,
	  'WG' => 1,
	  'DA' => 1,
	  'WC' => 2,
	  'DH' => 2,
	  'WK' => 3,
	  'HS' => 3,
	  'WP' => 4,
	  'HH' => 4,
	  'WF' => 5,
	  'DB' => 5,
	);
	$flip_s_tag = Array 
	(
	  'd' => 0,
	  'D' => 0,
	  'R' => 0,
	  'z' => 0,
	  'u' => 1,
	  'G' => 1,
	  'U' => 1,
	  'c' => 1,
	  'i' => 2,
	  'C' => 2,
	  'I' => 2,
	  'M' => 2,
	  'p' => 3,
	  'K' => 3,
	  'q' => 3,
	  'H' => 3,
	  'e' => 4,
	  'P' => 4,
	  'E' => 4,
	  'x' => 4,
	  'w' => 5,
	  'F' => 5,
	  'W' => 5,
	  'S' => 5,
	);
	//合成出的道具效果上限值（0级时）：
	$max_emix_itme_start = 45;
	//每等级能够提升的道具效果上限（具体计算方法在get_emix_itme_max()内）
	$max_emix_itme_up = 29;
	# 固定结果配方：按照指定顺序投入arr[1]份arr[0]元素
	$emix_fixlist = Array
	(
		# 移动PC：亮晶晶20、昼闪闪20
		Array('stuff'=>Array(0=>Array(0,20),1=>Array(4,20)),'result'=>Array('移動PC','EE',5,1,'z'),),
		# UG：投入全种类元素各1份
		Array('stuff'=>Array(0=>Array(0,1),1=>Array(1,1),2=>Array(2,1),3=>Array(3,1),4=>Array(4,1),5=>Array(5,1)),'result'=>Array('Untainted Glory','A',1,1,'Z'),),
		# 仪水镜：投入全种类元素各7份
		Array('stuff'=>Array(0=>Array(0,7),1=>Array(1,7),2=>Array(2,7),3=>Array(3,7),4=>Array(4,7),5=>Array(5,7)),'result'=>Array('儀水鏡','Y',1,1,''),),
	);
	# 素材随机的固定结果配方
	$rand_emix_fixlist = Array
	(
		//'stuff'=> 键名=>随机元素在数组中的自然排序的位置 键值=> 'r_x-y' 的格式等同于 rand(x,y)
		//'class'=>'hidden' 不会被提示纸条揭露的配方
		//0.电掣召唤仪：分解种火尸体随机获得：数量分别在1~10、10~20、20~30、30~40、40~50之间的5种不同元素
		0 => Array('stuff'=>Array(0=>'r1-10',1=>'r10-20',2=>'r20-30',3=>'r30-40',4=>'r40-50'),'result'=>Array('電掣召喚儀','Y',1,1,)),
		//1.游戏解除钥匙（执行官ID卡）：分解执行官尸体时依次获得：数量在1000~2000之间的3种不同元素
		1 => Array('class'=>'hidden','stuff'=>Array(0=>'r1000-2000',1=>'r1000-2000',2=>'r1000-2000'),'result'=>Array('遊戲解除鑰匙','Y',1,1,'v')),
		//2.游戏解除钥匙（真红暮）：分解冰炎钥匙火·冰时依次获得：数量在10000~99999之间的2种不同元素
		2 => Array('class'=>'hidden','stuff'=>Array(0=>'r10000-99999',1=>'r10000-99999'),'result'=>Array('遊戲解除鑰匙','Y',1,1,'Zv')),
		//3.破灭之诗：分解三女主歌词卡时依次获得：数量在100~999之间的3种不同元素
		3 => Array('class'=>'hidden','stuff'=>Array(0=>'r100-999',1=>'r100-999',2=>'r100-999'),'result'=>Array('破滅之詩','Y',1,1,95)),
		//4.黑色发卡：分解黑色碎片、十字发卡时依次获得：数量在500~1000、10000~29999之间的2种不同元素
		4 => Array('class'=>'hidden','stuff'=>Array(0=>'r500-1000',1=>'r10000-29999'),'result'=>Array('黑色髮卡','X',1,1,)),
		//5.『C.H.A.O.S』：分解武神尸体、琉璃血时依次获得：数量在39999~59999、39999~79999之间的2种不同元素 
		5 => Array('class'=>'hidden','stuff'=>Array(0=>'r39999-59999',1=>'r39999-79999'),'result'=>Array('『C.H.A.O.S』','Y',1,1,)),
		//单人脱出系列：大师要有大师风范，不准跑路！
	);
	//主要特征组合配方：合成时存在多个主要特征，依此表检查是否有特殊变化
	//obbs：满足条件时有obbs%的概率组合，不设置即为100%组合；random：开启研究模式的情况下，随机为此配方生成random个合成条件。
	$dommix_list = array
	( 	
		Array('stuff'=>Array('WG','WG','WG','WC','WD'),'result'=>'WJ','obbs'=>15,), //3射+1投+1爆=重枪（15%概率）
		Array('stuff'=>Array('WC','WC','WC','WG','WK'),'result'=>'WB','obbs'=>25,), //3投+1射+1斩=弓（25%概率）
		Array('stuff'=>Array('WG','WK'),'result'=>'WGK','obbs'=>77,), //射+斩=枪刃 
		Array('stuff'=>Array('WC','WF'),'result'=>'WCF','obbs'=>77,), //投+符=符札
		Array('stuff'=>Array('WC','WP'),'result'=>'WCP','obbs'=>77,), //投+殴=重物
		Array('stuff'=>Array('WF','WK'),'result'=>'WFK','obbs'=>77,), //符+斩=魔刃……？
		Array('stuff'=>Array('WK','WF'),'result'=>'WKF','obbs'=>77,), //斩+符=灵刃
		Array('stuff'=>Array('WK','WP'),'result'=>'WKP','obbs'=>77,), //斩+殴=重剑
		Array('stuff'=>Array('WD','WG'),'result'=>'WDG','obbs'=>77,), //爆+射=巨炮
		Array('stuff'=>Array('WD','WF'),'result'=>'WDF','obbs'=>77,), //爆+符=落魂
		Array('stuff'=>Array('WD','DF','WD'),'result'=>'VD'), 
		Array('stuff'=>Array('WG','DA','WG'),'result'=>'VG'), 
		Array('stuff'=>Array('WC','DH','WC'),'result'=>'VC'), 
		Array('stuff'=>Array('WK','HS','WK'),'result'=>'VK'), 
		Array('stuff'=>Array('WP','HH','WP'),'result'=>'VP'), 
		Array('stuff'=>Array('WF','DB','WF'),'result'=>'VF'), 
		Array('stuff'=>Array('HH','HS'),'result'=>'HB','obbs'=>77,), //回命+回体=命体回复
		Array('stuff'=>Array('HH','WF'),'result'=>'HM','obbs'=>77,), //回命+灵=歌魂增加
		Array('stuff'=>Array('HS','WD'),'result'=>'HT'), //回体+爆=歌魂恢复
		Array('stuff'=>Array('HH','WG'),'result'=>'MH','obbs'=>15,), //回命+射=生命强化
		Array('stuff'=>Array('HS','WC'),'result'=>'MS','obbs'=>60,), //回体+投=体力强化
		//我认为这里应该有一个配方 可以合出有毒补给或者地雷（
	);
	# 次要特征组合配方：将次要特征转化为道具属性时，检查是否满足组合条件。两个配方存在重复元素时，排在前面的会优先生成。
	$submix_list = array
	( 	
		Array('stuff'=>Array('u','x','z'),'result'=>'f','obbs'=>33), 
		Array('stuff'=>Array('i','x','z'),'result'=>'k','obbs'=>33),
		//伤害制御：5个奇迹……现在的机制的话，大概是0.67*0.67*0.01的概率
		Array('stuff'=>Array('x','x','x','x','x'),'result'=>'h','obbs'=>1),
	);
	# 随机的次要特征组合配方 注意：指定属性（sk_*）一定要放到最前面
	$random_submix_list = Array
	(
		//连击：随机1个价值在20以上，1个价值在30以上的次要特征
		Array('stuff'=>Array(0=>'v_20',1=>'v_30'),'result'=>'r','obbs'=>33),
		//冲击：随机1个价值在20以上特征+1个随机“攻击”标签特征
		Array('stuff'=>Array(0=>'tags_W',1=>'v_20'),'result'=>'N','obbs'=>50),
		//贯穿：重击辅助+随机2个价值在30以上的次要特征
		Array('stuff'=>Array(0=>'c',1=>'v_30',2=>'v_30'),'result'=>'n','obbs'=>45),
		//破格：陷阱探测+随机2个价值在30以上的次要特征
		Array('stuff'=>Array(0=>'M',1=>'v_30',2=>'v_30'),'result'=>'y','obbs'=>45),
		//属性防御：随机1个价值在30以上+2个随机“防御”标签特征
		Array('stuff'=>Array(0=>'v_30',1=>'tags_D',2=>'tags_D'),'result'=>'a','obbs'=>50),
		//全系防御：随机2个价值在30以上的次要特征+1个随机“防御”标签特征
		Array('stuff'=>Array(0=>'v_30',1=>'v_30',2=>'tags_D'),'result'=>'A','obbs'=>50),
	);
	# 可重复生成的次要特征
	$repeat_subtags = Array('u','i','e','w','p');

	//合成结果-名字：
	$emix_luck_info = Array(-2 => '自己要倒大黴了QAQ……',1 => '這次合成的結果應該沒什麼特別之處。', 2=>'這次合成的結果還算不錯。', 3=>'這次合成的結果似乎相當不錯！' ,4=>'有什麼大好事要發生了！');
	//合成过程中随机产生的东西
	$emix_tips_arr = Array('天然','喜悦','靈感','奇蹟','愛','期待','憤怒','悲傷','樂子','苦悶','既視感','瘋狂','幸運','ＲＰ','罪業');
	//括在名字外围的符号
	$emix_name_brackets_arr = Array('☆+☆','★+★','〖+〗','【+】','『+』','「+」','✦+✦','☾+☽','☼+☼');
	//修饰前缀，由主元素决定，有多个主元素时随机抽取。主元素组合成功时再抽取通用前缀。
	$emix_name_prefix_arr = Array
	(
		0 => Array('灰白的','霧濛濛的','失去顏色的','罕見的','挑染的','浮誇的','有名的','吸引來龍的','不值錢的','黑色布偶熊的','大咧咧的','吃不完的'),//'亮晶晶'
		1 => Array('火熱的','温暖的','混沌的','燃燒着的','地雷的','致命的','有引力的','陽炎的','紅髮的','超可愛的','被餘暉染上的','瘋狂的','活在記憶裏的'),//'暖洋洋'
		2 => Array('無暇的','快速的','凍住的','生人勿近的','貓的','喜歡宅在家裏的','流動的','冷靜的','濁心的','高潔的','黏在鐵上的','被召喚來的'),//'冷冰冰'
		3 => Array('翡翠的','活力的','生命的','愛的','空虛的','有反差的','雙馬尾的','迷路了的','加了五分糖的','天然呆的','從樹上長出來的','落葉歸根的'),//'郁萌萌' //什么！？原来不是郁闷的郁！
		4 => Array('晨曦的','閃閃發光的','金髮的','高潔的','像齒輪一樣的','邁向明日的','初生的','躍動的','環形的','心懷希冀的','金色的','小男孩的'),//'昼闪闪'
		5 => Array('宵暗的','無聲的','活死人的','能停止時間的','無眠的','已經困了的','噩夢的','夢見羊的','夢見門之鑰的','喝提神飲料的','黑漆漆的'),//'夜静静'
		6 => Array('神秘的','有魔力的','結構複雜的','用AI模擬的','不可名狀的','差不多完美的','終局的','爛尾的','打通了的','世界盡頭的','第四面的'),//泛用
	);
	//元词缀，随便挑一个非主元素的
	$emix_name_meta_arr = Array
	(
		0 => Array('亂序之','寶石紋','鐳射型','鏡面紋','藏書','晶化','化合型','糖漿','石紋','雜糅','透明紋','印花','蕾絲綴','簡約'),//'亮晶晶'
		1 => Array('燃素之','篝火之','黃昏之','晌午','鳳凰','猩紅','暖石','強襲型','破壞型','蘋果','血紋','酒紅'),//'暖洋洋'
		2 => Array('迅捷化','魚紋','操弄之','碎心','旁觀之','路人之','狡黠之','凜風之','北極星','霧之','魔咒','激流之'),//'冷冰冰'
		3 => Array('生命之','薔薇紋','根鬚','咖啡','妖精','吱吱亂叫之','生薑','拿鐵','葉形紋','風化','仿製','紡錘狀'),//'郁萌萌'
		4 => Array('啓示之','神之','王國制','旭日之','英雄之','榮光之','燈籠狀','螢火之','教條','麻將','騎士之','亮片'),//'昼闪闪'
		5 => Array('怪異化','黑洞之','視界之','牧人羊','往事之','循環之','弔詭之','小鬼之','刻奇之','五芒星','爬行者'),//'夜静静'
		6 => Array('空白','留聲型','映像型','迴響型','氣動型','雙生之','差分機','飛艇型','紙之','琉璃','以太制','黃銅製','賢者之'),//拓展1
	);
	//词尾
	$emix_name_tail_arr = Array
	(
		'WK' => Array('劍','刃','斧','戟','鋒刃','光劍','匕首','菜刀','牙','骨','燧石','線'),//'锐器'
		'WP' => Array('棒','錘','槌','惃棒','木棒','昆棒','盾','指虎','火箭飛拳','鞭','松果彈抖閃電鞭','氣勁','偽器'),//'钝器'
		'WC' => Array('鏢','卡牌','球','雪','飛盤','飛彈','弓','矢','青蛙','水滴','鋼琴','貓'),//'投掷'
		'WG' => Array('槍','光槍','燧發槍','步槍','炮','浮游炮','激光','掌心雷','彈弓','導彈發射器'),//'远程'
		'WJ' => Array('狙擊步槍','反坦克步槍','巨炮','武器陣列','手提箱','連裝炮'),//'重枪'
		'WB' => Array('強弓','角弓','箭雨','鐵弓','短弓','豎琴','獵弓','暴風','落星'),//'弓'
		'WD' => Array('炸彈','地雷','打擊','此面向敵','貝蒂','繩','陷坑','抽卡遊戲','短視頻','勝負欲','這是什麼？摸一下'),//'爆炸物'
		'WF' => Array('符','手環','節杖','觸','法書','紙人','信徒','精神性','理論','天賦','秘錄','蟑螂'),//'灵武'
		//TODO：复合武器
		'D' => Array('物'),//不分类防具
		'DB' => Array('甲','衣','裝','翼','西裝','洋裝','裙','死庫水','燈籠褲','胖次','紙箱','彈藥包','戰甲B'),
		'DH' => Array('盔','鏡','帽','風帽','緞帶','髮卡','護目鏡','投影','假説','抑制器','檢測裝置','戰甲H'),
		'DA' => Array('盾','掌','手套','朋友','匣子','魚鱗','力場盾','魚竿','手錶','手環','鐐銬','命數','戰甲A'),
		'DF' => Array('鞋','靴','爪','加護','軌跡','腳步','飛毯','馬靴','草鞋','觸手','尾巴','滑板','戰甲F'),
		'H' => Array('秘藥','罐頭','糊糊','杏仁豆腐','烤魚麪包','章魚須','烏雞肉','生海帶','幸運餅乾','長芽土豆','眼淚','趣味'),//补给
		'V' => Array('指南','卷軸','手冊','秘籍','樂譜','知識','共鳴','秘術','法典','廣告','指引','教導','語錄'),//技能书
		'M' => Array('羽毛','結晶','精華','甘露','魂','眼','心','血','魔核','寶珠','力量','勇氣','波紋'),//强化药物
		'0' => Array('怪東西','？？？','竟然是它','■■■','數據削除'),//BUG词尾：没有找到类别的情况下会变成这个
	);

	/********研究模式配置********/
	//特征的“特征”……
	//嘛总之就是那个意思：武器上不会出现防御，防具上不会出现攻击属性这样……	
	$itmk_to_itmsk_tags = Array
	(
		//攻击面特征
		'W' => Array('u','e','i','w','p','d','r','f','k','R','S','o','n','N','y'),
		//可以直接由元素得到的攻击面特征
		'W_0' => Array('u','e','i','w','p','d','S'),
		//防御面特征
		'D' => Array('P','K','C','G','D','F','U','E','I','W','q','M','a','A','B','b'),
		//可以直接由元素得到的防御面特征
		'D_0' => Array('P','K','C','G','D','F','U','E','I','W','q','M'),
		//杂项特征
		'misc' => Array('z','x','c','h','H','l','g','Z'),
	);

	//提示纸条：
	$emix_slip = Array
	(
		0 => '“在元素合成時，投入份數最多的元素會成為‘主元素’，其展現出的‘主特徵’會影響所合成道具的‘用途’”<br>“這點你已經知道了對吧？”<br>“但如果投入其他元素的‘份數’與‘主元素’很接近的話……也許它們的‘主特徵’會混合起來？”<br>',
		1 => '“在元素合成時，投入的元素所展現出的‘次要特徵’會影響所合成道具的‘屬性’”<br>“這點你已經知道了對吧？”<br>“但如果把不同元素的‘特徵’混合起來的話，它們有時會彼此反應，從而衍生出新的‘特徵’。”<br>',
		2 => '“補給品、子彈這些消耗品，能分解出來的元素很少，有種説法是元素們討厭這種被消耗的感覺。”<br>“但是從書本或強化藥物這種價值不菲的消耗品上獲得的元素又會變多。”<br>“很有哲理吧？”<br>',
		3 => '“如果在分解元素的過程中遇到了什麼奇怪的狀況，找個本子記錄下來會比較好。”<br>“説不定以後會派上用處的。”<br>',
		4 => '“如果實在不知道該合成什麼的話，不妨試試把每種元素都丟1份進去看看。”<br>“説實話我也不知道會發生什麼，所以出了事不要怨我啊！”<br>',
		5 => '“據説元素們在變化成具體形狀時會發出奇怪的動靜……説不定是在用元素語罵人呢？”<br>',
		6 => '“據説要將元素的‘次要特徵’附着在物品上時，會產生某種奇特的發酵物的味道。”<br>“其實元素合成的原理和醃鹹菜也差不多吧？”<br>',
		7 => '“有種有趣的説法是：‘在數字1-10裏，7是最孤獨的——因為只有它既不能成為因子、也不能被整除。’”<br>“如果你很閒的話，應該還能找到很多這樣的規律。”<br>“或者你也可以試試把每種元素都丟進去7份看看？”<br>',
		8 => '“你有沒有試着分解過‘手機’和‘筆記本電腦’？”<br>“雖然不知道為什麼這些東西上也會有元素。但寄宿在其上的元素數量與種類似乎是固定的。如果把這些固定的元素重新組合起來的話……？”<br>',
		9 => '“你有沒有試過把帶有‘生命恢復’與‘體力恢復’特徵的元素組合起來？”<br>“嘛，就算沒試過，你應該一眼就能看出來會發生什麼了。但是如果把它們分別與更有‘攻擊性’的元素組合起來的話……？”<br>',
	);
?>
