<?php
if(!defined('IN_GAME')) exit('Access Denied');

//投系福袋 - WC
//CATCH THEM ALL 「全部收集」
//(0-50)itmlow
//(51-75)itmmedium
//(76-98)itmhigh
//(99-100)antimeta 

$itmlow = <<<EOT
臉,WC,60,12,,
高級球,WC,221,34,n,
超級球,WC,183,46,w,
豪華球,WC,166,68,,
快速球,WC,127,55,,
黑暗球,WC,175,14,,
計時球,WC,163,90,r,
究極球,WC,91,183,Zr,
EOT;

$itmmedium = <<<EOT
鐵獸戰線 徒花之費莉吉特 Ｌ2,WC,204,60,nd,
鐵獸戰線 兇鳥之施萊格 Ｌ4,WC,460,40,e,
電子龍·凱旋 Ｌ2,WC,446,50,p,
秘旋諜-雙螺旋特工 Ｌ2,WC,502,70,,
海晶少女 妙晶心 Ｌ2,WC,323,75,rw,
海晶少女 奶嘴海葵 Ｌ2,WC,343,70,r,
淘氣仙星·霍莉安琪兒 Ｌ2,WC,480,65,rui,
真超級量子機神王 烈輝大炎磁 Ｌ3,WC,520,30,Zrn,
EOT;

$itmhigh = <<<EOT
閉鎖世界的冥神 Ｌ5,WC,2222,256,Zuwdr,
鐵獸式強襲機動兵裝改牛頭伯勞2 Ｌ5,WC,2777,188,Zfd,
防火龍·暗流體 Ｌ5,WC,1555,256,Zkw,
前託槍管龍 Ｌ5,WC,3877,158,Zikdr,
電子界到臨者＠火靈天星 Ｌ6,WC,4788,480,Zkfd,
召命之神弓-阿波羅薩 Ｌ4,WB,3200,4,kZcb,
EOT;

$antimeta = <<<EOT
隨機數之神的神力,WC,88888,888,ZRx,
EOT;
?>