<?php
if(!defined('IN_GAME')) exit('Access Denied');

$itmlow = <<<EOT
臉,WP,60,12,,
臉,WK,60,12,,
臉,WG,60,12,,
臉,WC,60,12,,
臉,WD,60,12,,
臉,WF,60,12,,
臉,DB,60,12,,
臉,DH,60,12,,
臉,DA,60,12,,
臉,DF,60,12,,
裝有H173的注射器,Y,1,1,,
空白符卡,X,1,1,,
電擊器模型,WP,51,35,e,
尋星者模型,WK,51,35,d,
環形激光模型,WG,51,72,uo,
永恆飛刃模型,WC,51,200,r,
電磁脈衝IED模型,WD,51,28,ed,
開海【海水分開之日】弱化版,WF,51,28,i,
EOT;

$itmmedium = <<<EOT
【北斗百裂拳】,WP,200,30,r,
【狂暴兇刃】,WK,200,30,r,
【蓋特機炮】,WG,200,30,r,
幻符【殺人玩偶】,WC,200,30,r,
【泰迪熊炸彈】,WD,200,30,dr,
【西方秋霜玉】,WF,200,30,r,
《小黃的草帽》,DH,30,30,,
《小黃的背心》,DB,40,30,G,
《小黃的釣魚竿》,DA,30,30,,
《小黃的行軍靴》,DF,30,30,,
『扭曲力場』,DB,80,25,UI,
『扭曲力場』,DB,80,25,qE,
『扭曲力場』,DB,80,25,WD,
【宇航服】,DB,80,30,Aa,
【蝶古拉的斗篷】,DB,500,1,Bb,
戰鬥力指示器,DH,76,54,c,
EOT;

$itmhigh = <<<EOT
☆My Little Buster☆,WF,1200,∞,rd,
篝醬的奇蹟☆絲帶～刃,WK,4200,100,cjN,
究級篝醬加農炮,WG,4800,200,ir,
【霜火協奏曲】的金質模型,WP,1024,256,uNwdr,
雪拉比的時空球,WC,12000,∞,,
【KEY系催淚彈】,WD,3600,5,zd,
黑色奪魂曲,DB,57,77,ZBb,
武器師安雅的獎賞,Y,1,5,,
★一發逆轉神話★,TNc,1,1,x,
EOT;

$antimeta = <<<EOT
【詛咒之角】,A,1,1,+,
【衰弱羽翼】,A,1,1,*,
【厄運蹄鐵】,A,1,1,-,
EOT;
?>