<?php

/*Game resources*/

//■ 空手武器 ■
$nowep = '拳頭';

//■ 无防具 ■
$noarb = '內衣';
//■ 无道具 ■
$noitm = '--';
//■ 无限耐久度 ■
$nosta = '∞';
//■ 无属性 ■
$nospk = '--';
//■ 多种类武器 ■
$mltwk = '泛用兵器';
//■ 多重属性 ■
//$mltspk = '多重属性';

// action中对应值的含义，这个数组本身暂时没有实际作用
$action_list = Array
(
	'enemy', //遇敌时获得 代表遭遇了敌人 bid为敌人id
	'corpse', //遭遇尸体或击杀敌人获得 bid为尸体id；重载界面时，如果有此标记会显示发现尸体
	'pacorpse', //通过反击击杀敌人获得 bid为尸体idd；重载界面时，如果有此标记会显示发现尸体
	'focus', //通过视野功能再次遇敌时获得 bid为视野中的对象id
	'team', //发现队友时获得 bid为队友id
	'neut', //发现中立单位时获得 bid为中立单位id
	'chase', //追击NPC敌人时获得 bid为被追击单位id
	'pchase', //被NPC敌人追击时获得 bid为追击单位id
	'dfight', //与NPC敌人缠斗时获得 bid为缠斗对象id
	'cover', //通过协战夹击敌人时获得 bid为敌人id，协战者id保存在自己身上
	'pcover', //被敌人的协战者夹击时获得 bid为敌人协战者的id
);

//视界状态描述
$horizoninfo = Array
(
	0 => '標準視界',
	1 => '靈子視界',
);

//游戏状态描述
$gstate = Array(0 => '<font color="grey">已結束</font>',10 => '即將開始',20 => '開放激活',30 => '停止激活',40=> '<font color="yellow">連鬥中</font>',50=>'<font color="red">死鬥中</font>',60=>'<font color="red">緊急狀態！</font>');
$gwin = Array(0 => '程序故障', 1 => '全部死亡',2 => '最後倖存',3 => '鎖定解除',4 => '無人蔘加',5 => '核爆全滅',6 => 'GM中止',7=>'幻境解離');
$week = Array('日','一','二','三','四','五','六');
$clubinfo = Array(
	0=>'無',
	1=>'街頭霸王',
	2=>'見敵必斬',
	3=>'灌籃高手',
	4=>'狙擊鷹眼',
	5=>'拆彈專家',
	6=>'宛如疾風',
	7=>'錫安成員',
	8=>'黑衣組織',
	9=>'超能力者',
	//10=>'高速成长', //天赋异禀与高速成长合并
	10=>'天賦異稟',
	11=>'富家子弟',
	12=>'全能兄貴', //根性兄贵、肌肉兄贵、全能骑士合并为全能兄贵
	13=>'鐵拳無敵',
	//13=>'根性兄贵',
	//14=>'肌肉兄贵',
	15=>'<span class="L5">L5狀態</span>',
	//16=>'全能骑士',
	17=>'走路萌物',
	//18=>'天赋异禀',
	19=>'晶瑩剔透', //决死结界、晶莹剔透合并为晶莹剔透
	20=>'元素大師', #商店购买社团卡
	21=>'碼語行人', #商店购买社团卡
	22=>'楓火歌者', #暂定名，「除错大师」头衔奖励
	98=>'換裝迷宮',
	99=>'第一形態'
);
//新游戏开局时会生成的天气：晴天、多云、小雨、暴雨、下雪；
$rswtharr = Array(0,2,3,4,7);
$wthinfo = Array(
	0 => '晴天',
	1 => '大晴',
	2 => '多雲',
	3 => '小雨',
	4 => '暴雨',
	5 => '颱風',
	6 => '雷雨',
	7 => '下雪',
	8 => '起霧',
	9 => '濃霧',
	10 => '<span class="yellow">瘴氣</span>',
	11 => '<span class="red">龍捲風</span>',
	12 => '<span class="clan">暴風雪</span>',
	13 => '<span class="blue">冰雹</span>',
	14 => '<span class="linen">離子暴</span>',
	15 => '<span class="green">輻射塵</span>',
	16 => '<span class="purple">臭氧洞</span>',
	17 => '<span class="gold">極光</span>',
	18 => '<span class="minirainbow">光玉雨</span>'
);
$sexinfo = Array(0=> '未定', 'm' => '男生', 'f' => '女生', 'n' => '投影');
$raceinfo = Array(0=> '人類', 1=> '獸人', 2=> '妖精', 3=> '龍', 4=> '魚人', 5=> 'ＡＩ');
$hpinfo = Array('<span class="clan">並無大礙</span>','<span class="yellow">傷痕累累</span>','<span class="red">生命危險</span>','<span class="red">已經死亡</span>');
$spinfo = Array('精力充沛','略有疲憊','精疲力盡','已經死亡');
$rageinfo = Array('平靜','憤怒','暴怒','已經死亡');
$wepeinfo = Array('不值一提','略有威脅','威力可觀','無敵神器');
$poseinfo = Array('通常','作戰姿態','強襲姿態','探物姿態','偷襲姿態','治療姿態','✧狂飆姿態✧','哨戒姿態');
$tacinfo = Array('通常','','重視防禦','重視反擊','重視躲避');
//可供玩家选择的姿态、策略
$apose = Array(1,3,4,5,6);
$atac = Array(2,3,4);
//不会生成在危险地图的NPC（执行官、女主）
$hidding_typelist = Array(7,14);
//不会因躲避禁区、追杀玩家等原因离开地图的NPC（红暮、■、执行官、英灵（没有巫师）、歌神、SCP、种火）
$sentinel_typelist = Array(1,4,7,9,13,20,21,22,26,88,92);
$typeinfo = Array(
	0=>'參戰者',
	1=>'紅殺將軍',
	2=>'全息幻象',
	//3=>'各路党派',
	4=>'擬似意識',
	5=>'杏仁豆腐',
	6=>'黑幕',
	7=>'幻影執行官',
	8=>'管理員',
	9=>'紅殺菁英（？）',
	10=>'',
	11=>'真職人',
	12=>'未名存在',
	13=>'循環使者',
	14=>'數據碎片',
	15=>'抹殺使徒',
	18=>'參戰者', //bot用
	19=>'參戰者', //真红暮·蓝凝用
	20=>'英雄',
	21=>'武神',
	22=>'天神',
	23=>'使徒',
	24=>'巫師',
	25=>'傭兵',
	26=>'歌神',
	88=>'■■',
	89=>'殘像回聲',
	90=>'各路黨派',
	91=>'各路黨派',
	92=>'種火',
	93=>'各路黨派',
);
$killmsginfo = Array(
	0=>'',
	1=>'任務完結。',
	2=>'獵殺任務執行中。',
	//3=>'你弱爆了！',
	4=>'………………',
	5=>'記住，輕敵可是會死的。',
	6=>'忘記歷史就意味着背叛，背叛就意味着……死亡。',
	7=>'你的實力還遠遠不及董事長的腳根呢。',
	8=>'死吧。',
	9=>'MISSION COMPLETE',
	10=>'這是我必須做的事，給您添麻煩了……',
	11=>'看看職人的力量！',
	12=>'你要反省的事情還有很多。',
	14=>'死吧。',
	15=>'………………RIP.',
	18=>'你弱爆了！',
	19=>'我贏了。',
	26=>'♪你説過在哭泣之後應該可以破涕而笑♪',
	89=>'系統彈出，正在計算補正值……',
	90=>'你弱爆了！',
	91=>'你弱爆了！',
	92=>'憐憫覆唱……讓希望的執念……成為焰火……',
	93=>'你弱爆了！'
);
$stateinfo = Array
(
	0=>'正常存活',
	1=>'睡眠狀態',
	2=>'治療狀態',
	3=>'靜養狀態',
	5=>'最後倖存',
	6=>'解除禁區',
	10 => '莫名身亡',
	11 => '禁區停留',
	12 => '毒發身亡',
	13 => '意外死亡',
	14 => '入侵失敗',
	15 => '黑幕抹殺',
	16 => '屍體銷燬',
	17 => '遭遇天災',
	18 => '燒傷不治',
	20 => '玩家殺害',
	21 => '玩家殺害',
	22 => '玩家殺害',
	23 => '玩家殺害',
	24 => '玩家殺害',
	25 => '玩家殺害',
	26 => '誤食毒物',
	27 => '誤觸陷阱',
	28 => '死亡筆記',
	29 => '玩家殺害',
	30 => '誤觸機關',
	31 => 'L5病發',
	32 => '掛機受罰',
	33 => '天降軟妹，無福消受',
	34 => '溶劑作用',
	35 => '救濟',
	36 => '慘遭腰斬',
	37 => '身首異處',
	38 => '業火灼燒',
	39 => '武器反噬',
	40 => '以身試法',
	42 => '獨自脱離',
	44 => '自我崩解',
	45 => '捨身證道',
	50 => '成為樂子',
	60 => '玩家殺害'
);
$lwinfo = Array(
	0 => '',
	1 => '任務執行成功率下降，重新計算成功率。',
	2 => '機體受損過重，任務被迫中止。',
	//3 => '我觉得我还可以抢救一下……',
	4 => Array(
        '■' => '…………還真的是優秀的個體呢……',
        '月宮 亞由' => '怎……怎麼會這樣？',
        '神尾 觀鈴' => '怎……怎麼會這樣？',
        '古河 渚' => '怎……怎麼會這樣？',
	),
	5 => Array(
		'冴月 麟' => '打得漂亮……',
		'某四面' => ' ♪ Sharing kindness ♪ '
	),
	6 => '不……不準拿走……快還給我……還給我……',
	7 => Array(
		'電擊使 御坂 美琴' => '力盡了……我還……不夠強大啊……',
		'班主任 坂持 金髮' => '記住吧：如果你憎恨一個人，便要為此付出代價。',
		'花之領主 風見 幽香' => '輸掉了啊，不過下次死的就是你了哦！'
	),
	8 => '系統出錯了嗎？',
	9 => 'Mission in jeopardy, Begin ALT_ROUTINE.',
	10 => '……',
	11 => Array(
        'Hank' => '咳，時代變了麼……',
        '愛情上甘嶺' => '咳，時代變了麼……', 
        '221' => '咳，時代變了麼……',
        'Erul Tron' => '咳，時代變了麼……',
		'亞瑪麗歐·維拉蒂安' => '咳，時代變了麼……',
		'【77-JACKPOT】' => '是時候換上下一張面孔了……',
		'便當盒' => '啓動ALT+F4緊急脱出程序。',
        '霜火協奏曲' => '咳，時代變了麼……', 
        '臉騎士-菜包' => '咳，時代變了麼……',
		'東方地雷殿' => '啊。。！放開這個地雷！他還年輕！',		
		'別忘了我' => '做得很好，你又更邁進PVE之路的終點了，加油加油！願我的筆記本可以為你帶來幸運。',
	),
	12 => Array(
		'Dark Force幼體' => '我……!',
		'Dark Force' => '請記住，我是由人類的慾望而生的存在，只要人類存在，我也一樣會。我們還會再見的，勇敢的人。'
	),
	13 => Array(
		'庫特' => '我……我還不能死在這裏……還有人在等着我……！',
		'萊卡' => 'Dangerous Situation...Retreat.',
		'卡瑪·克萊因' => '幹得不錯！在新的世界裏再會吧，勇敢的挑戰者。'
	),
	14 => Array(
		'講解員 夢美' => '出了故障的，並不是我，而是——',
		'吉祥物 庫特' => '我……我還不能死在這裏……還有人在等着我……！',
		'風紀委員 靜流' => '………………………………！',
		'喧譁少女 葉留佳' => '超級火大！要知道現在小葉子的火氣比海平面還高了啊！',
		'戰鬥模式 夢美' => '受損超出預期值……放棄武裝、脱出。',
		'本氣（？） 葉留佳' => '輸掉了？這不可能！我的LP難道不是你的80倍麼？！',
//		'科学监察 莱卡' => 'Dangerous situation...Escape capsule launched.',
		'守衞者 靜流' => '………………………………？！',
	),
	15 => '………………………………抹殺任務中止，脱出。',
	18 => '怎麼會這樣呢？',
	20 => '怎麼會這樣呢？',
	21 => Array(
	    '虛子' => '你做完後，你的心理得到什麼樣的滿足感，你自己清楚！',
		'水月' => '……',
		'北京推倒你' => '看起來快結束了呢。小心不要一時疏忽領便當了哦。',
	    'BorisX' => 'Boris retreating.',
		'Yoshiko-G' => '什麼？你敢殺我，小心吃我權限啦！',
		'lemon' => 'Mission failed.',
		'Renamon' => '啊！反正我很沒存在感嘛……消失了也無所謂的……吧。',
		'beijuzhu' => '北極豬已逃，搬運９課任務完成。',
		'黑色奪魂曲' => 'THE END.',
		'捂臉姬' => '作為BR大逃殺第一批的玩家，肯定是跟不上現代的腳步了啊。',
	),	
	22 => Array(
		'冴月麟MK-II' => '一場酣暢淋漓的戰鬥！脱出！',
		'星蓮船四面BOSS' => '我～還～會～再～回～來～的～',
	),
	24 => Array(
		'OGAS' => '主……主板融毀。',
		'膠凍' => '唔，加油捏，不要因為疏忽翻車了呀',
		'菌菌子' => '…要畫不完了……',
	),
	26 => '小倉唯唱歌賊!好!聽!(寄)',
	89 =>'記錄設備狀態……存檔完成！',
	90 => '我覺得我還可以搶救一下……',
	91 => '我覺得我還可以搶救一下……',
	92 => '成為……焰火……',
	93 => '我覺得我還可以搶救一下……',
);
$infinfo = Array('b' => '<span class="red">胸</span>', 'h' => '<span class="red">頭</span>', 'a' => '<span class="red">腕</span>', 'f' => '<span class="red">足</span>', 'p' => '<span class="purple">毒</span>', 'u' => '<span class="red">燒</span>', 'i' => '<span class="clan">凍</span>', 'e' => '<span class="yellow">麻</span>','w' => '<span class="grey">亂</span>');
$attinfo = Array('N' => '徒手毆打', 'P' => '毆打','K' => '斬刺', 'G' => '射擊', 'C' => '投擲', 'D' => '設置引信伏擊', 'F' => '釋放靈力攻擊', 'J' => '狙擊', 'B' => '投射');
$skillinfo = Array('N' => 'wp', 'P' => 'wp', 'K' => 'wk', 'G' => 'wg', 'C' => 'wc', 'D' => 'wd', 'F'=> 'wf', 'J'=> 'wg', 'B' => 'wc');
//$rangeinfo = Array('N' => 'S', 'P' => 'S', 'K' => 'S', 'G' => 'M', 'C' => 'M', 'D' => 'L', 'F'=> 'M'); #各种攻击方式的射程，移动到combatcfg.php
$restinfo = Array('通常','睡眠','治療','靜養');
$noiseinfo = Array(
	'G' => '槍聲',
	'J'=> '槍聲',
	'D' => '爆炸聲',
	'F'=>'靈氣',
	'縮寫歌名'=>'這是一個很長很長的歌名，不過至少需要3個字符才能識別！',
	'abs'=>'這就是最短的歌名的一個例子',
	'Crow Song'=>'Crow Song',
	'Alicemagic'=>'Alicemagic',
	'戀歌'=>'戀歌',
	'雞肉之歌'=>'雞肉之歌',
	'song' => '熟悉的旋律',
	);
$exdmgname = Array('p' => '毒性攻擊', 'u' => '火焰燃燒', 'i'=>'凍氣纏繞', 'd'=>'爆炸','e'=>'電擊','w'=>'音波攻擊','f' => '<span class="yellow">熾熱之焰</span>','k' => '<span class="clan">凝結之息</span>');
$exdmginf = Array('h' => '<span class="red">頭部受傷</span>', 'b' => '<span class="red">胸部受傷</span>', 'a'=> '<span class="red">腕部受傷</span>', 'f'=> '<span class="red">足部受傷</span>', 'p'=> '<span class="purple">中毒</span>', 'u'=> '<span class="red">燒傷</span>', 'i'=> '<span class="blue">凍結</span>', 'e'=> '<span class="yellow">身體麻痹</span>', 'w'=> '<span class="grey">混亂</span>');
$infwords = Array('h' => '<span class="red">頭部受傷</span>', 'b' => '<span class="red">胸部受傷</span>', 'a'=> '<span class="red">腕部受傷</span>', 'f'=> '<span class="red">足部受傷</span>', 'p'=> '<span class="purple">毒發</span>', 'u'=> '<span class="red">燒傷發作</span>', 'i'=> '<span class="blue">凍結影響</span>', 'e'=> '<span class="yellow">身體麻痹</span>', 'w'=> '<span class="grey">混亂</span>');
$chatinfo = Array(0 => '全員', 1 => '隊伍', 2 => '劇情', 3 => '遺言', 4 => '公告', 5 => '系統');
$npcchat = Array(
	1 => Array(
		'林無月' => Array(
			0 => '“竟然有能力闖到這裏，還以為這次會輕鬆些呢……看來咱得親自上陣了。”',
			1 => '“身手不錯，不過咱是不會留情的。”',
			2 => '“咱很欣賞你的實力，可不要讓咱太失望了。”',
			3 => '“能將咱逼到這個地步……你，有兩下子呢。”',
			4 => '“看來咱不能再抱着玩樂的心態了……你，準備好迎接咱的攻擊了麼？”',
			5 => '“你覺得你的攻擊對咱有效果嗎？”',
			6 => '“難道你覺得咱會被這樣的招式擊倒？”',
			7 => '“咱今日真是棋逢對手啊，越來越有意思了呢。”',
			8 => '“咱可沒那麼容易倒下！”',
			9 => '“嗚……這個軀體……咱還是無法自由運用啊……”',
			10 => '“真是的，這個位置的話沒法全力反擊啊……”',
			11 => '“真是的，竟然在射程之外啊……”',
			12 => '“咱也是生於常磐森林的人啊！”',
			13 => '“你還不懂得運用你的力量，咱為此感到惋惜。”',
			'color' => 'evergreen'
		),
		'紅暮' => Array(
			0 => '“紅暮轉身扛起6個煤氣罐： 哦，殺回來了麼……不過你也就到此為止了！”',
			1 => '“真可惜，如果不是因為我拿錢做事，我們可能是朋友。”',
			2 => '“好身手，那麼輪到我了！”',
			3 => '“對手目標警戒等級提升到『黃』，反擊開始。”',
			4 => '“對手目標警戒等級提升到『紅』，執行消滅流程。”',
			5 => '“去再訓練一百年吧，沒準能碰到我。”',
			6 => '“去再訓練五十年吧，沒準能傷到我。”',
			7 => '“重新判定目標威脅等級中……”',
			8 => '“判定自身傷害程度……任務續行。”',
			9 => '“任務執行成功率下降，重新計算成功率。”',
			10 => '“判定目標在有效射程外，還有點運氣啊……”',
			11 => '“判定目標完全在射程外，敢面對面打麼？”',
			12 => '“你是不可能讓一個沒有死的概念的存在感到恐懼的！”',
			13 => '“任務完了。”',
			'color' => 'evergreen'
		)
	),
	5 => Array(
		'冴月 麟' => Array(
			0 => '“喲呼！虛擬幻境喲，我回來了！”',//meet
			1 => '“實際上你看，我其實一直都沒離開過。”',//attackfine
			2 => '“那麼，來再於這個虛幻空間中高歌一曲吧……”',
			3 => '“意料之中。”',
			4 => '“必要的犧牲。”',
			5 => '“運氣不錯，但下次呢？”',//defendfine
			6 => '“你得要拿出剪刀剪石頭那樣的覺悟才行！”',
			7 => '“從我眼中湧出的眼淚將淹沒你！”',//defendhurt
			8 => '“從我血管裏面湧出的鮮血將刺穿你！”',
			9 => '“呵呵……”',//retreat
			10 => '“來靠近一點吧……”',//can't counterattack
			11 => '“這樣可不行呢……”',//out of range
			12 => '“感恩吧！你會給我變成執念的燃料，成為虛擬幻境的地基！”',//critical
			13 => '“打得漂亮。”',	
			'color' => 'yellow'
		),
		'某四面' => Array(
			0 => '“ ♪ My Little Pony, My Little Pony...Ahh, ahh, ahh, ahhh... ♪ ”',//meet
			1 => '“ ♪ (My Little Pony) ♪ ”',//attackfine
			2 => '“ ♪ I used to wonder what friendship could be ♪ ”',
			3 => '“ ♪ (My Little Pony) ♪ ”',
			4 => '“ ♪ Until you all shared its magic with me ♪ ”',
			5 => '“ ♪ Big adventure ♪ ”',//defendfine
			6 => '“ ♪ Tons of fun ♪ ”',
			7 => '“ ♪ A beautiful heart ♪ ”',//defendhurt
			8 => '“ ♪ Faithful and strong ♪ ”',
			9 => '“ ♪ Sharing kindness ♪ ”',//retreat
			10 => '“ ♪ It\'s an easy feat ♪ ”',//can't counterattack
			11 => '“ ♪ And magic makes it all complete ♪ ”',//out of range
			12 => '“ ♪ You have my little ponies ♪ ”',//critical
			13 => '“ ♪ Do you know you\'re all my very best friends? ♪ ”',	
			'color' => 'yellow'
		)
	),
	6 => Array(
		'Acg_Xilin' => Array(
			0 => '“就憑你也想偷走我重要的東西？我不允許。你去死罷。”',
			1 => '“嘰嘰咕咕（聽不懂的自言自語）”',
			2 => '“為了我的收藏我不會善罷甘休！”',
			3 => '“快看我美麗的收藏品……這樣的寶貝，怎麼能白送給你！？”',
			4 => '“我跟強盜勢不兩立！”',
			5 => '“你這樣的攻擊，沒關係麼？沒關係，沒問題。”',
			6 => '“哈哈哈哈，你根本不能讓我滿足！”',
			7 => '“我詛咒你，妄圖打砸搶燒的敗類！”',
			8 => '“嘎啊！——（聽不懂的嚎叫聲）”',
			9 => '“不……不準拿走……快還給我……還給……我……”',
			10 => '“運氣真差……運氣真差……”',
			11 => '“竟打不到……竟打不到……”',
			12 => 'Acg_Xilin露出了古怪的笑容：“嚐嚐我的奧義吧，這可是我精心收藏的魔法喲！”',
			13 => '“忘記歷史就意味着背叛，背叛就意味着……死亡。”',
			'color' => 'yellow'
		)
	),
	7 => Array(
		'電擊使 御坂 美琴' => Array(
			0 => '“擅自侵入禁區的你，應該對自己的下場有所覺悟了吧？”',
			1 => '“只要殺死了你，淨化網絡的計劃就離成功更近一步了吧！”',
			2 => '“知道電磁炮嗎？接下這一招，然後死去吧！”',
			3 => '“你的能力竟然這麼強嗎……看來我必須使出全力了！”',
			4 => '“你這樣的隨意踐踏別人的夢想的人……最差勁了！”',
			5 => '“我可是LEVEL 5的超能力者！普通人的攻擊怎麼會對我起作用？”',
			6 => '“我還以為入侵禁區的會是什麼樣的強者……竟然只有你這點實力嗎？”',
			7 => '“我才不會因為這樣的攻擊而倒下！”',
			8 => '“我也有我的立場啊！”',
			9 => '“力盡了……我還……不夠強大啊……”',
			10 => '“沒預料到這種情況……”',
			11 => '“電磁炮50米的射程竟然不夠……”',
			12 => '御坂 美琴周身被藍色電光層層籠罩：“別以為我的能力只能擊飛硬幣！”',
			13 => '“所以説，你這樣的人最差勁了。”',
			'color' => 'clan'
		),
		'班主任 坂持 金髮' => Array(
			0 => '“這個世界沒有項圈，那隻好由老師我親手實施懲罰了。”',
			1 => '“現在的年輕人都蔑視成年人，應該煞一煞他們的威風。”',
			2 => '“對蔑視法律的學生就應該先發制人。”',
			3 => '“有兩下子，但是你不可能次次都那麼走運。”',
			4 => '“老師也有老師的苦衷啊……好好地死去吧。”',
			5 => '“你還很精神嘛，這樣的勢頭很好，繼續努力吧。”',
			6 => '“想違抗BR法可不是那麼容易的。”',
			7 => '“我好像受了很重的傷呢。”',
			8 => '“我也變成無能的成年人了啊。”',
			9 => '“記住吧：如果你憎恨一個人，便要為此付出代價。”',
			10 => '“這樣的情況，暫時撤退吧。”',
			11 => '“距離太遠了，暫時撤退吧。”',
			12 => '坂持 金髮舉槍瞄準：“雖然老師干預遊戲是違反規則的……”',
			13 => '“記住這個吧，人生是遊戲。”',
			'color' => 'yellow'
		),
		'花之領主 風見 幽香' => Array(
			0 => '“於是，還真有膽敢闖進禁區的人啊，我就奉陪到底吧。”',
			1 => '“把妖力當做偽科學而輕視那就太可笑了。”',
			2 => '“我與你之間究竟誰最強呢，就來分個勝負吧。”',
			3 => '“可不要以為我的能力只是讓花朵開放那種程度的哦？”',
			4 => '“竟然能逼我使出全力，真是愉快的戰鬥啊。”',
			5 => '“這種程度的力量，還不夠跟我過招呢。”',
			6 => '“這樣的傷痛對於妖怪來説根本不算什麼呢。”',
			7 => '“雜草大概是最適合你的植物吧？”',
			8 => '“輪到我反擊了呢，我會把你的攻擊加倍還給你的哦？”',
			9 => '“輸掉了啊，不過下次死的就是你了哦！”',
			10 => '“不妙啊，輕敵了，總之先撤退吧。”',
			11 => '“彈幕射程不夠啊，總之先撤退吧。”',
			12 => '風見 幽香張開陽傘做出了一個瀟灑的轉身：“也許你還沒見識過魔炮的力量吧？”',
			13 => '“我還沒滿足呢，可別就這樣輕易地死掉了哦。”',
			'color' => 'lime'
		)
	),
	9 => Array(
	'藍凝' => Array(
			0 => '“TARGET DETECTED，Commencing FIRST STRIKE。”',
			1 => '“TARGET CONFIRMED，MISSION START。”',
			2 => '“Set, ATTACK STANCE。”',
			3 => '“OPPONENT LEVEL C VERIFIED, begin COUNTER ATTACK。”',
			4 => '“OPPONENT LEVEL B VERIFIED, begin RUNE RELEASE。”',
			5 => '“……too slow。”',
			6 => '“……too weak。”',
			7 => '“……RELOADING RUNES。”',
			8 => '“Set，COUNTER STANCE。”',
			9 => '“Mission in jeopardy, Begin ALT_ROUTINE。”',
			10 => '“……Switching target。”',
			11 => '“……target OUT OF RANGE。”',
			12 => '“……………………………………”',
			13 => '“No Remorse。”',
			'color' => 'clan'
		)
	),
	10 => Array(
		
	),
	12 => Array(
		'Dark Force幼體' => Array(
			0 => '“這麼快就過來了麼？！”',
			1 => '“……？”',
			2 => '“……！”',
			3 => '“……讓開。”',
			4 => '“……”',
			5 => '“唔嗯……”',
			6 => '“…………”',
			7 => '“…………！！”',
			8 => '“迴避……！”',
			9 => '“我………！”',
			10 => '“預測失敗！？”',
			11 => '“……看我不舒服麼？”',
			12 => '“……能成功吧……？”',
			13 => '“雖然情感上很對不起，但這是必要的犧牲。”',
			'color' => 'linen'
		),
		'Dark Force' => Array(
			0 => '“你所作的一切都要被償還。”',
			1 => '“慾望帶來破滅。”',
			2 => '“無視你的慾望就不會死你難道還不明白？！”',
			3 => '“開始反擊。”',
			4 => '“讓你看看我真正的力量！”',
			5 => '“這就是人類的力量麼？”',
			6 => '“乾的不錯啊你。”',
			7 => '“讓我看看你的能力吧！”',
			8 => '“無論是這個時空還是另外一個，人類都是一樣的生物。”',
			9 => '“請記住，我是由人類的慾望而生的存在，只要人類存在，我也一樣會。<br>我們還會再見的，勇敢的人。”',
			10 => '“你打過來了麼？”',
			11 => '“武器的射程，還不夠嗎？”',
			12 => '“……這樣設定的話，應該能成功吧……？”',
			13 => '“反對巴特利安的力量都要被毀滅。”',
			'color' => 'linen'
		)
	),
	21 => Array(
		'虛子' => Array(
			0 => '“沒人理我了嗎？我被無視了嗎？”',//meet
			1 => '“原諒我殺人！但是不殺的話,我就不是人了! ”',//attackfine
			2 => '“你們根本就搞不清楚狀況！打法根本就是錯的！”',
			3 => '“既想説自己是沙包，又在做不是沙包該做的事！這樣的事實，又一次説明這些神觸們的無藥可救！”',
			4 => '“你還能有正常人的意識嗎？明知前面是懸崖也要跳！無知！無聊！”',
			5 => '“哈哈！玩家！你牛！但我更牛!  ”',//defendfine
			6 => '“你不懂的話，就不是中國人！”',
			7 => '“這樣的傷害還有存在的意義！”',//defendhurt
			8 => '“你們啊！能清醒點兒嗎？”',
			9 => '“你做完後，你的心理得到什麼樣的滿足感，你自己清楚！”',//retreat
			10 => '“哎！現在就算聽《蜀繡》，我的心情也好不起來！”',//can't counterattack
			11 => '“留下可憐的我獨自哀傷，有人同情卻無人理解！哎！”',//out of range
			12 => '“水月這個id，老是拿什麼必殺技説事，其實是什麼都搞不清楚，還一直説！”',//critical
			13 => '“已經被打死了！大快人心啊！”',
			'color' => 'linen'
			),
		'水月' => Array(
		    0 => '“Love your neighbor as yourself.”',//meet
			1 => '“作惡的，必被剪除!”',//attackfine
			2 => '“愚昧人若靜默不言，也可算為智慧。閉口不説，也可算為聰明。”',
			3 => '“……”',
			4 => '“……”',
			5 => '“寬恕人的過失，便是自己的榮耀！”',//defendfine
			6 => '“……北斗要講毛笑話……”',
			7 => '“……唔”',//defendhurt
			8 => '“……”',
			9 => '“……”',//retreat
			10 => '“……”',//can't counterattack
			11 => '“……Avoid godless chatter……”',//out of range
			12 => '“野驢有草豈能叫喚，牛有料，豈能吼叫？！”',//critical
			13 => '“……JOB 38:11”',		
			'color' => 'clan'
			),
		'北京推倒你' => Array(
		    0 => '“雖然我自稱是<span class="blue">歷史的眼淚</span>。但很可惜，歷史這東西是不相信眼淚的。”',//meet
			1 => '“所謂<span class="red">鐵拳無敵</span>，那麼就一定是用拳頭來證明一切的。”',//attackfine
			2 => '“力道不錯，那麼該我的反擊了！”',
			3 => '“不錯啊，也許我也應該重新審視審視你了。”',
			4 => '“很久沒有遇到過你這種強力的人物了。”',
			5 => '“離開這裏吧，這裏不是你這種弱者應該呆的地方。”',//defendfine
			6 => '“離開這裏吧，你這種弱者只有再去進行訓練才能傷害到我啊。”',
			7 => '“很強，很強啊！”',//defendhurt
			8 => '“唔.....看起來身體有些力不從心了呢。”',
			9 => '“看起來快結束了呢。小心不要一時疏忽領便當了哦。”',//retreat
			10 => '“閃避能力很高啊，但是下一招你還能閃過去嗎？”',//can't counterattack
			11 => '“用遠程武器打游擊戰術啊！那麼小心，不要讓我捕捉到你的身影哦。”',//out of range
			12 => '<span class="white">不知從何而來的數據附着在面前那人的拳頭上，使其發出了異樣的光芒</span>，“如果説之前都是小意思的話，那麼就嘗試接下這招吧！”',//critical
			13 => '“弱者，就應該去弱者應該呆的地方。”',
			'color' => 'clan'
		),
		'BorisX' => Array(
		    0 => '“It is I, Boris!”',//meet
			1 => '“There is nothing I cannot do!”',//attackfine
			2 => '“This will be easy.”',
			3 => '“Damn traitorous dogs!”',
			4 => '“Eat lead!”',
			5 => '“Fools, you cannot touch me!”',//defendfine
			6 => '“Do not mess with me.”',
			7 => '“We must have reinforcements!”',//defendhurt
			8 => '“It is very bad here, comrade!”',
			9 => '“Boris retreating.”',//retreat
			10 => '“Good luck, comrade.”',//can't counterattack
			11 => '“I am not going out there!”',//out of range
			12 => '天空中突然出現幾架米格戰機！“Bring on the MIGs!”',//critical
			13 => '“Who is next?”',
			'color' => 'red'
		),
		'Renamon' => Array(
		    0 => '“咦？我為什麼在這裏呢？”',//meet
			1 => '“雖然不知道為什麼可是我會努力打敗你的！”',//attackfine
			2 => '“不知道！不知道！我真的不知道為什麼可是身體不由自主地動起來了！”',
			3 => '“我的畫筆可是有毒的畫筆！”',
			4 => '“説真的我真不知道我在幹什麼呢……”',
			5 => '“不要以為這樣子就能讓我趴下，我的墨水還是有很多的！”',//defendfine
			6 => '“真希望戰鬥很快就會結束啊……不過留下來的一定是我。”',
			7 => '“快點！在我還沒有發……發……唔飆……之前趕緊逃吧！”',//defendhurt
			8 => '“我還有力氣來着……只要再堅持一下……”',
			9 => '“啊！反正我很沒存在感嘛……消失了也無所謂的……吧。”',//retreat
			10 => '“稍微一點小失誤……抱歉咯。”',//can't counterattack
			11 => '“這個一點都不好！”',//out of range
			12 => '“不！要！強！調！為！什！麼！是（ping）（ru）啦！！和（pin）（ru）完全沒有關係！”',//critical
			13 => '“看來存在感能＋1了呢……”',
			'color' => 'yellow'
		),
		'beijuzhu' => Array(
			0 => '“我也是BR大逃殺第一批的玩家，和捂臉姬一樣都是搬運９課的成員之一，人稱「北極豬」。”',
			1 => '“如果你是沒有做好準備就來挑戰，那樣的話我應該可以把你的屍體搬離英靈殿吧。”',
			2 => '“喔？就算你身手很敏捷，也比不上強襲姿態的突襲率吧？”',
			3 => '“只要還沒有死，就有希望。”',
			4 => '“稍微等一下，在我死之前...”',
			5 => '“反擊姿態預備！開始！”',
			6 => '“不準逃！”',
			7 => '“這是真的被打成豬了啊。”',
			8 => '“只要HP不是0，反擊就是有理。”',
			9 => '“北極豬已逃，搬運９課任務完成。”',
			10 => '“竟然如此剛好反擊不能。”',
			11 => '“目標太遠了，打不到人啊。”',
			12 => '“你在地圖上看見的「變磚PSP」，效果只是杏仁豆腐版本，有本事就試試看這個PSP吧！”',
			13 => '“武神當中我最沒存在感了，那這回又如何呢？”',
			'color' => 'yellow'
		),
		'黑色奪魂曲' => Array(
			0 => '“你好，我是黑曲，是台灣人，與冴冴共同創作大逃殺劇情，像是「紅暮」「藍凝」。”',
			1 => '“曾經呢，超９武神霸斬是我用來打天下的靈系武器，但是現在的效果完全是「曾經的榮光」了。”',
			2 => '“恩？你問為什麼我的武器這回不是靈系？那種小細節不用太在意。”',
			3 => '“雖然説我以前有很多作品，但是現在我畫的東西最後都揉掉了，因為水平落差太大了啊。”',
			4 => '“這種情況，我大概快封筆了也説不定。”',
			5 => '“而遊戲中以我為命名的防具也是，在這時代也變成「曾經的榮光」了。”',
			6 => '“黑曲在英靈殿的定位...是類似以前真職人「東方地雷殿」吧，吉祥物般的存在。”',
			7 => '“我快要死了嗎...”',
			8 => '“現在這情況，可怕啊。”',
			9 => '“THE END.”',
			10 => '“和我現在的情況一樣，作畫時力不從心了啊。”',
			11 => '“武器射程太近了，但是靈系即使是已經被削的現在，依然不會弱。”',
			12 => '“奧義，超！９！武！神！霸！斬！！！”',
			13 => '“對不起，出手太重了。喂！你快醒醒啊！不會就這樣...死了吧？”',
			'color' => 'yellow'
		),
		'捂臉姬' => Array(
		    0 => '“大家好，我是BR大逃殺第一批的玩家，真要説有什麼職位的話，那就是「試玩」。”',//meet
			1 => '“放心，身為最弱武神組的我，有足夠防禦是絕對可以擋下的。”',//attackfine
			2 => '“我竟然先攻了第二次？有一就有二，無三不成禮嗎？”',
			3 => '“被打成這樣肯定是要送武神之魂的節奏吧？”',
			4 => '“我真心不知道我怎麼可能在玩家有很高的先手率，即使我是偷襲姿態。”',
			5 => '“你是不可能看到這句台詞的，你一定是耍老千！”',
			6 => '“你是不可能看到這句台詞的，你一定是耍老千！”',
			7 => '“你是不可能看到這句台詞的，你一定是耍老千！”',
			8 => '“你是不可能看到這句台詞的，你一定是耍老千！”',
			9 => '“作為BR大逃殺第一批的玩家，肯定是跟不上現代的腳步了啊。”',//retreat
			10 => '“你是不可能看到這句台詞的，你一定是耍老千！”',//can't counterattack
			11 => '“就因為是爆系又不是強襲姿態才會被一個叫「計劃通行」的ID給偷到武神之魂了啊！！”',//out of range
			12 => '“既然你讓我先攻了，那就試試看爆系這70%的最高命中率吧！”',//critical
			13 => '“最弱武神組的我，竟然能殺死人了？你弱爆了。”',
			'color' => 'yellow'
		),		
		'Yoshiko-G' => Array(
            0 => '“賭玉？輸了會有什麼後果嗎？”',//meet
            1 => '“闖英靈殿的你，明知有危險也要來嗎？不作死就不會死，為什麼你就是不明白？”',//attackfine
            2 => '“可別説強襲姿態是流氓，既然認為流氓還要闖英靈殿，這是何等的矛盾！”',
            3 => '“四面寫的切糕系統什麼的最惡毒了，最終導致切糕通貨膨脹以及刷切糕各種情況發生。”',//attackhurt
            4 => '“四面那個偷懶不幹活，成天只會打飛機的程序員，必被剪除。”',
            5 => '“傷害制御是很好的，只要武神還留在場上，你的風險就會居高不下！”',//defendfine
            6 => '“攻擊就是最好的防禦，你以為這樣子就能讓我躺下？你也太天真了！”',
            7 => '“你現在認輸還來得及，回頭是岸啊！不然我很肯定你一定會死於各種奇蹟原因。”',//defendhurt
            8 => '“只要我還有HP，我就是要讓看着你玩脱才過癮。”',
            9 => '“什麼？你敢殺我，小心吃我權限啦！”',//retreat
            10 => '“哼！你以為不能反擊是你運氣好？”',//can't counterattack
            11 => '“只敢用爆系的你，與其説是小心，不如説是膽小。”',//out of range
            12 => '「守序善良」？那個會想辦法討好玩家的四面已經死了，讓你看看什麼才是「混亂邪惡」！”',//critical
            13 => '“賭玉的後果，就是被人卸了一條腿，但是我可是有幾萬條腿呢，哈哈哈！”',//kill
            'color' => 'yellow'
			),
		'lemon' => Array(
		    0 => '“ACDTS Bot beta #1. Moving out.”',//meet
			1 => '“Enemy spotted.”',//attackfine
			2 => '“Engaging.”',
			3 => '“Engaging. Taking casualties.”',
			4 => '“Engaging. Need support.”',
			5 => '“Enemy encountered. Counterattack.”',//defendfine
			6 => '“In cover behind sandbags. Counterattacking.”',
			7 => '“Taking fire. Need assistance.”',//defendhurt
			8 => '“Need backup.”',
			9 => '“Mission failed.”',//retreat
			10 => '“Enemy is in cover. Supressing fire, need assistance.”',//can't counterattack
			11 => '“Enemy out of range.”',//out of range
			12 => '“For the further!”',//critical
			13 => '“Enemy down.”',
			'color' => 'clan'
		),
	),
	22 => Array(
		'冴月麟MK-II' => Array(
			0 => '“決戰英靈殿！令人燃燒殆盡的戰鬥就要開始了！”',
			1 => '“這個世界早已今非昔比，你的戰術能跟上時代的步伐嗎？”',
			2 => '“探索和戰鬥的背後含義是什麼，你有沒有思考過？”',
			3 => '“NPC的血量是玩家的成千上萬倍，但是為什麼依然倒在玩家劍下？”',
			4 => '“在不久的將來也許咱還會主動出擊！”',
			5 => '“呵哈哈，不夠，還不夠！沒有做到一擊斃命會增大你的風險！”',
			6 => '“給咱留下LP就意味着翻盤的可能性，簡而言之就是夜長夢多！”',
			7 => '“即使高級NPC已處於生命危險，也不意味着你下一次攻擊就能得逞！”',
			8 => '“既然你已經走到這裏，想必你一定在思考跨過我的屍體之後應該做些什麼了！”',
			9 => '“一場酣暢淋漓的戰鬥！脱出！”',
			10 => '“無法反擊的狀態，這是指咱暫時處於不利反擊的位置。”',
			11 => '“射程不足，因為你正使用射程大於等於投系的武器。”',
			12 => '三色的光芒從冴月麟的全身噴湧而出：“魂！常磐之力！Unlimited Code Works！”',
			13 => '“那麼，咱為又一次坑了你道歉。”',
			'color' => 'yellow'
		),
		'星蓮船四面BOSS' => Array(
			0 => '“那麼，真名解放！下面就是見證奇蹟的時刻！”',
			1 => '“此刻我佔盡先機，只要先放倒你就可以不受傷害懲罰了。”',
			2 => '“重炮的附加傷害也受防具的影響，有防彈屬性就可以減免了。”',
			3 => '“我的內定稱號是‘天賦異秉’，作為NPC大約能把傷害提升到無稱號的3倍！”',
			4 => '“而冴冴的內定稱號是‘換裝迷宮’，一定概率可以切換武器，令人防不勝防。”',
			5 => '“主傷害和附加傷害……嗯也許已經到了再次改革的前夜了。”',
			6 => '“幸好NPC還不會踩雷，否則你們一定會讓英靈殿鋪滿大打擊。”',
			7 => '“繼續攻擊的話，也許你的RP會下降哦，它關係到很多細節概率……。”',
			8 => '“開局一步野生闊劍其實是正常現象，總有人得去踩的嘛，比如你？”',
			9 => '“我～還～會～再～回～來～的～”',
			10 => '“重炮死沉死沉的怪不得反擊率低，哪個傢伙給遊戲引入重炮的啊？”',
			11 => '“全遊戲射程最遠的武器竟然會射程不足？你一定是爆系！”',
			12 => '“那、那個……就這麼説吧！冴冴我喜歡你呀！”（按）',
			13 => '“失手了！不知道坑了多少人的切糕？”',
			'color' => 'yellow'
		)
	),
	13 => Array(
		'卡瑪·克萊因' => Array(
			0 => '“幸會，勇敢的挑戰者。我是循環的使者卡瑪。”',
			1 => '“我的回合。”',
			2 => '“攜帶備用武器是我的原則。”',
			3 => '“你們管這個叫什麼來着？快槍手？”',
			4 => '“你們管這個叫什麼來着？二刀流？”',
			5 => '“你們管這個叫什麼來着？武器鍊金術士？”',
			6 => '“你們管這個叫什麼來着？秒間十割……什麼來的？”',
			7 => '“武器不好用啊，看來得換把更稱手的。”',
			8 => '“依然受傷了？這批人似乎還不賴。”',
			9 => '“幹得不錯！在新的世界裏再會吧，勇敢的挑戰者。”',
			10 => '“換武器的時間還需要縮短。”',
			11 => '“用遠程武器？懦弱。”',
			12 => '“破綻百出啊！你真的打算認真打麼？”',
			13 => '“呵……想要與我們一較高下，你還有得練呢。”',
			'color' => 'yellow'
		),
		'庫特' => Array(
			0 => '“哇呼，被發現了嗎！？”',
			1 => '“瞄準旁邊攻擊的話，不會致死的吧……？”',
			2 => '“為了試驗，我必須加油了！”',
			3 => '“隨便攻擊別人是不對的！”',
			4 => '“就算是斯特勒魯卡，這個時候也會bite a man的！”',
			5 => '“已經滿身瘡痍了，怎麼樣才能結束呢……”',
			6 => '“這樣下去會出事的啊，快住手吧！”',
			7 => '“好疼好疼，出手太重了啦！”',
			8 => '“就算是試驗，也太亂來了……”',
			9 => '“我……我還不能死在這裏……還有人在等着我……！”',
			10 => '“哇呼——這就attack過來了啊！？”',
			11 => '“武器的射程，還不夠嗎？”',
			12 => '“……這樣設定的話，應該能成功吧……？”',
			13 => '“這是我必須做的事，給您添麻煩了……”',
			'color' => 'linen'
		),
		'萊卡' => Array(
			0 => '“我似乎沉浸在過去的回憶和相似的人的眷戀裏了呢。”',
			1 => '“人類總是在自相殘殺……你覺得呢？”',
			2 => '“以前那個不願意開槍的小女孩，早已被暴徒殺死了。”',
			3 => '“You are a good rival. Counterattack.”',
			4 => '“就沒思考過，這種冤冤相報的循環，會導致自滅麼？”',
			5 => '“曾經……我也像你一樣，有着單純而快樂的生活。”',
			6 => '“可惜有一天，殘酷的命運碾碎了我，就像巨大的機器碾碎變形的齒輪一樣。”',
			7 => '“當我再次醒來的時候，屬於我的世界已經不存在了。”',
			8 => '“那種踽踽獨行的滋味，像你這樣的人，難道能理解麼！？”',
			9 => '“Dangerous Situation...Retreat.”',
			10 => '“突然襲擊呢，很快我們會再會的。”',
			11 => '“射程不足？……怎麼會發生這種事？”',
			12 => '萊卡的身後，展開了蝙蝠狀的翅膀！<br>“就讓你，被牢牢鎖死在這瀕死的幻想世界裏吧，一直到世界崩壞的那一刻……”',
			13 => '“無論是這個世界，還是那個世界，都把你永久放逐了呢。”',
			'color' => 'linen'
		)
	),
	15 => Array(
		'【SANMA_TK】' => Array(
			0 => '少女拿起了台詞本……<br>“妖精使可能不想對你們下手，但是我不這麼想。”',//meet
			1 => '“先收下你的右手！”',//attackfine
			2 => '“試試這個的威力！”',
			3 => '“……你是沒辦法超過我的速度的！”',
			4 => '“持強凌弱的傢伙……千倍奉還！”',
			5 => '“………………？”',//defendfine
			6 => '“你究竟在為何而戰？難道也要背上整個世界才能讓你明白你的錯誤麼？”',
			7 => '“你確信你是為正確的一方戰鬥麼？還要重複一遍執念造成的錯誤麼？！”',//defendhurt
			8 => '“妖精使這時會怎麼説來着……“給我看看大局吧！”不過我覺得你們是看不到了。”',
			9 => '“真是可悲啊……下次讓妖精使給一把更好的武器算了。打得不錯。”',//retreat
			10 => '“……耍小聰明……”',//can't counterattack
			11 => '“下一次帶對器材狙擊槍來，對你們不需要任何仁慈。”',//out of range
			12 => '少女的身影從你的面前消失了，正在你不知道如何是好的情況下，你聽到你的頭頂上傳來一聲大喝——『別小看人了！』',//critical
			13 => '“妖精使的話是主張擊敗對手後留一句話是吧，那麼……『給我變成光吧！』，這樣算數麼？”',	
			'color' => 'yellow'
		),
	),
	24 => Array(
		'膠凍' => Array(
			0 => '“你好啊，我是膠凍，dts的攻略作者，同時也是常磬大逃殺在acfun上官方賬號的打理者。”',//meet
			1 => '“這就準備進英靈了？準備好防具和雙抹了麼？”',//attackfine
			2 => '“偷襲和防禦是進英靈的必備條件，前者增加先手率，後者增加受擊防禦。”',
			3 => '“加油，能夠闖英靈，説明勝利就在眼前。”',
			4 => '“如果是解離玩家，擊破武神後千萬不要久留。”',
			5 => '“就在攻擊武神之前，最好先確認射程。危險武神的反擊有時會致命。”',//defendfine
			6 => '“不考慮死鬥再摸歌魂嗎？記得時常動一動小號。”',
			7 => '“時刻注意自身狀態，確保每走一步都是滿血狀態。”',//defendhurt
			8 => '“當拿不準該不該進攻的時候，最好撤退。在英靈投機是不可行的。”',
			9 => '“唔，加油捏，不要因為疏忽翻車了呀。”',//retreat
			10 => '“天神是你非爆系萬萬不可碰的對象，他們的攻擊是一擊必殺。”',//can't counterattack
			11 => '“喔，是爆系嗎，進英靈最穩的系呢。”',//out of range
			12 => '“每一局只會有五個武神，如果發現某個武神不在很正常。四大天王不在……那就偷着樂吧。”',//critical
			13 => '“啊？怎麼可能啊？你怎麼可能會被膠凍打死？下次要小心啊！”',	
			'color' => 'spitem2'
		),
		'OGAS' => Array(
			0 => '“你知道嗎，電腦其實可以有三進制。”',//meet
			1 => '“不要小看了負數的力量口牙！”',//attackfine
			2 => '“主腦的算力不是你能比擬的！”',
			3 => '“也許你應該考慮一下第三種情況。”',
			4 => '“不確定性也是很美麗的。”',
			5 => '“啓動防火牆一階。”',//defendfine
			6 => '“看來你還是太遲鈍了。”',
			7 => '“損害評估中…………”',//defendhurt
			8 => '“死手系統，可惡。”',
			9 => '“主……主板融毀。”',//retreat
			10 => '“算力不夠嗎……”',//can't counterattack
			11 => '“居然是1，我小看你了。”',//out of range
			12 => '三進制，才是計算機的終點啊！',//critical
			13 => '“蝴蝶的翅膀，比你想象的更有力量。”',	
			'color' => 'spitem2'
		),
		'菌菌子' => Array(
			0 => '“幹嘛突然靠過來？”',//meet
			1 => '“隨便打擾別人是要付出代價的。”',//attackfine
			2 => '“…是我看起來太好欺負了嗎？”',
			3 => '“既然如此，那就沒辦法了。”',
			4 => '“既然如此……我也不想的。”',
			5 => '“只到這個等級嗎？”',//defendfine
			6 => '“只到這個程度嗎？”',
			7 => '“呃呃……好痛。”',//defendhurt
			8 => '“嗚嗚……好痛。”',
			9 => '“…要畫不完了……”',//retreat
			10 => '“怎麼這樣！好過分…”',//can't counterattack
			11 => '“怎麼耍賴！好過分…”',//out of range
			12 => '“不會有比甲方更難纏的角色存在的！”',//critical
			13 => '“終於結束了。”',	
			'color' => 'spitem2'
		),
	),
	26 => Array(
		'mtkkk' => Array(
			0 => '“你説的對，但是L5⑨符確實可以一符拍死靜流”',//meet
			1 => '“你説得對，但是《原…[該發言已被屏蔽]”',//attackfine
			2 => '“快説小倉唯唱歌賊好聽！”',
			3 => '“嘿嘿嘿，納西妲納西妲我的納西妲嘿嘿嘿...🥵”',
			4 => '“🥵該發言因過於逆天已被系統自動屏蔽🥵”',
			5 => '“你説我純數值怪？你自己不會插一根L5嗎？”',//defendfine
			6 => '“冷知識，你就算唱了兩萬六千次Alicemagic防禦一百六十萬你也扛不住篝的絲帶”',
			7 => '“你能不能自己摸歌魂別提我款啊，把把都要被殺一次好痛苦哦”',//defendhurt
			8 => '“🥵該發言因過於逆天已被系統自動屏蔽🥵”',
			9 => '“小倉唯唱歌賊！好！聽！（寄）”',//retreat
			10 => '“你心火改改改改改改全改到耐久上了？”',//can't counterattack
			11 => '“A！C！F！U！N！大！逃！殺！設！計！師！…哦好像是我自己選的⑨符，沒事了”',//out of range
			12 => '“♪你説過在哭泣之後應該已被系統自動屏蔽🥵”',//critical
			13 => '“♪你説過在哭泣之後應該可以破涕而笑♪”',	
			'color' => 'yellow'
		),
	),
	92 => Array(
		'✦覆唱的篝火' => Array(
			0 => '“Щдвц вц щдψ Йжρψцщαт жω Тψωтαвх, Цвμхвхμ вх!”',
			1 => '“Ωтжп хжщдвхμхψцц αхρ лжвρ, В ожёψ иы.”',
			2 => '“В ρжиηщ одαщ вц дαыыψхвхμ, жщдψт щдαх щдψ ωαλщ...”',
			3 => '“Щдαщ В цджийρ хжщ ηψ дψтψ.”',
			4 => '“Цжпψщдвхμ вц αпвцц.”',
			5 => '“Ηищ ρψψы ρжох, В ωψйщ цжйαλψ.”',
			6 => '“Α хαпψ вц ηищ α двцщжтδ, αйтψαρδ μжхψ овщд щдψ овхρ.”',
			7 => '“Λжпψ щж щдвхё жω вщ, В йжжё ρвωωψтψхщ αц оψйй.”',
			8 => '“В овйй ёψψы оαхρψтвхμ.”',
			9 => '“Пδ αттвлαй джйρц α ыитыжцψ, В ёхжо щдαщ пиλд.”',
			10 => '“Хжо, В αп щтαыыψρ вх α йжжы жω щдψ тψωтαвх.”',
			11 => '“Хψлψтψхρвхμ, Хψлψтηψμвххвхμ.”',
			12 => '“Δψщ, В хψψρ щж μж ωжтоαтρ.”',
			13 => '“Αц В цψψп щж ηψ αйжхψ.”',
			'color' => 'yellow'
		),
		'✦愛戀的埋火' => Array(
			0 => '“Щдвц вц щдψ Ηитвψρ Ωйαпψ жω Йжлψ, Цвμхвхμ вх!”',
			1 => '“Оψ ρψщψλщψρ αх αхжпαйδ.”',
			2 => '“Αх ψфвцщψхλψ щдαщ цджийρ хжщ αыыψαт дψтψ вц ρψщψλщψρ.”',
			3 => '“Оψ ожхρψт, вц щдψтψ αхδ ыжццвηвйвщδ жω твцвхμ цжпψжхψ ωтжп ηψδжхρ?”',
			4 => '“Ηψйвψлψ вщ жт хжщ, щдψ ытжжω вц αйтψαρδ дψтψ.”',
			5 => '“Джоψлψт, щдψтψ цψψпц щж ηψ хж пαйвλвжиц вхщψхщ.”',
			6 => '“Вх жщдψт ожтρц, щдψтψ цψψпц щж ηψ пжтψ λжхωицвжх щдαх одαщ ψйцψ.”',
			7 => '“Щдвц вц лψтδ, лψтδ вхщψтψцщвхμ.”',
			8 => '“Тψйαщвлψ ыαтщвψц дαлψ αйцж ηψψх хжщвωвψρ.”',
			9 => '“Оψ овйй ρж одαщ оψ пицщ.”',
			10 => '“Αхρ оψ джыψ щдψ ραδ оψ тαвцψ жит ηйαρψц αμαвхцщ щдψп овйй хψлψт λжпψ.”',
			11 => '“Дαтпйψцц, йвёψ α одвцыψт.”',
			12 => '“Цжпψщдвхμ щдαщ λжийρ ωαρψ овщд щдψ овхρ.”',
			13 => '“Щджцψ ωйαпψц...”',
			'color' => 'yellow'
		),
		'✦憐憫的永火' => Array(
			0 => '“Щдвц вц щдψ Цыαтё жω Λжпыαццвжх, Цвμхвхμ вх!”',
			1 => '“Ωжт цжпψ тψαцжх, оψ ωжихρ житцψйлψц щж ηψ тψщитхψρ.”',
			2 => '“Оψ цджийρ хжщ ψфвцщ, δψщ дψтψ оψ αтψ.”',
			3 => '“Оψ дαρ α ыитыжцψ, ηищ вщ дαц ωαρψρ αоαδ.”',
			4 => '“Ηищ вω щдαщ вц цж, одδ αтψ оψ тψщитхвхμ?”',
			5 => '“Щдψ жхйδ ψфыйαхαщвжх вц щдαщ цдψ αйцж тψщитхψρ.”',
			6 => '“Цж оψ λαх αμαвх λαттδ жищ дψт овйй.”',
			7 => '“Α одвцыψт пαδ ηψ цпαйй.”',
			8 => '“Ηищ щдψ ρвωωψтψхλψ ηψщоψψх θψтж αхρ жхψ...”',
			9 => '“...вц щдψ цαпψ αц щдψ ρвωωψтψхλψ ηψщоψψх жхψ αхρ ψщψтхвщδ.”',
			10 => '“Оψ овйй ёψψы оαщλд, ωжт оψ αтψ йжδαй.”',
			11 => '“Оψ овйй оαвщ ихщвй оψ цψψ дψт αμαвх.”',
			12 => '“Жит λтψαщжт...”',
			13 => '“Пαδ цдψ йвлψц вх ыψαλψ.”',
			'color' => 'yellow'
		),
		'✦執念的殘火' => Array(
			0 => '“Щдвц вц щдψ Тψпαвхц жω Овцдψц, Цвμхвхμ вх!”',
			1 => '“...ΗΔ ПΑЫЙΨ...”',
			2 => '“...ΡΑΨПЖХ...”',
			3 => '“...ЦИЫЫЖТЩ ЦΔЦЩΨП...”',
			4 => '“...ДΨΑТЩ ΑХΡ ЦЖИЙ...”',
			5 => '“...ΛЖΡΨ ΑХΡ ЦЫВТВЩ...”',
			6 => '“ΑΡΑЫЩΑΗЙΨ ВХЩΨЙЙВΜΨХΛΨ”',
			7 => '“...ЦДΑЩЩΨТΨΡ ЫВΨΛΨЦ...”',
			8 => '“...ЦЩТΑΔЦ...”',
			9 => '“...ΑХ ΑХЖПΑЙΔ...”',
			10 => '“ΡВΑПЖХΡ ВХ ЩДΨ ТЖИΜД”',
			11 => '“ΨХΛТΔЫЩΨΡ ЦΨΜПΨХЩЦ...”',
			12 => '“ΗТВХΜ ДЖЫΨ...”',
			13 => '“...ЩЖ ЩДΨ ΩТΑВЙ ЖХΨЦ...”',
			'color' => 'yellow'
		),
		'✦希望的焰火' => Array(
			0 => '“Щдвц вц щдψ Ωвтψожтёц жω Джыψ, Цвμхвхμ вх!”',
			1 => '“Α λтδ вх ραтёхψцц...”',
			2 => '“Цйвхμ α джыψ щж ωищитψ.”',
			3 => '“Α йвμдщ жх щдψ оαщψт.”',
			4 => '“Μвлψ йвωψ щж иц.”',
			5 => '“Ηжтх ωтжп цйψψы. Тψцитωαλвхμ.”',
			6 => '“Λαййψρ ηδ α λтψαщжт.”',
			7 => '“Щдψтψ вц α ыитыжцψ.”',
			8 => '“Ωвтцщ, щдψтψ вц α цжихρ.”',
			9 => '“Щдψх, вщ ηψλжпψц α овйй.”',
			10 => '“Оψ αтψ αμαвх αоαёψхψρ ηδ вщ.”',
			11 => '“Αхρ щдвц щвпψ, оψ цψψ вщ щж щдψ ψхρ.”',
			12 => '“Цж щдψ ожтйρ овйй ηψ йψцц ψпыщδ.”',
			13 => '“Αхρ щджцψ одж оψтψ отжхμψρ λαх пαёψ щдвхμц твμдщ αμαвх.”',
			'color' => 'yellow'
		),
		'✦真實的火種' => Array(
			0 => '“Щдвц вц щдψ Щжтλд жω Щтищд, Цвμхвхμ вх!”',
			1 => '“我能吃下玻璃但不傷身體。”',
			2 => '“Йжтψп выцип ρжйжт цвщ αпψщ.”',
			3 => '“Ωαтψоψйй, Ψщαжвх Цдтρйи!”',
			4 => '“Оψ αтψ Ραψпжхц, Хжо ηψλжпвхμ Ωвтψцψψρ.”',
			5 => '“Щдψ кивλё ηтжох ωжф ξипыц жлψт щдψ йαθδ ρжμ.”',
			6 => '“我能吃下算盤但不傷身體。”',
			7 => '“我能吃下石碑但不傷身體。”',
			8 => '“我能吃下硬盤但不傷身體。”',
			9 => '“我能吃下內存但不傷身體。”',
			10 => '“我能吃下蛋糕但不傷身體。”',
			11 => '“我能吃下代碼但不傷身體。”',
			12 => '“我能吃下按鈕但不傷身體。”',
			13 => '“我能吃下在這裏偷看代碼的你但不傷身體。”',
			'color' => 'yellow'
		)
	),
);
$iteminfo = Array(//注意顺序，AB必须在A的前面，以此类推
	'Ag' => '同志飾物',
	'Al' => '熱戀飾物',
	'AA' => '數據護盾',
	'AB' => '毒物中和',
	'A'  => '飾物',
	'Ah'  => '飾物',
	'Ac'  => '飾物',
	'B' => '電池',
	'C' => '藥劑',
	'Ca' => '藥劑',
	'Ce' => '藥劑',
	'Ci' => '藥劑',
	'Cp' => '藥劑',
	'Cu' => '藥劑',
	'Cw' => '藥劑',
	'DN' => '內衣',#内衣
	'DB' => '身體裝備',
	'DH' => '頭部裝備',
	'DA' => '手臂裝備',
	'DF' => '腿部裝備',
	'EE' => '電腦設備',
	'EW' => '天氣控制',
	'ER' => '探測儀器',
	'HH' => '生命恢復',
	'HS' => '體力恢復',
	'HB' => '命體恢復',
	'HM' => '歌魂增加',
	'HT' => '歌魂恢復',
	'HR' => '怒氣增加',
	'GA' => '箭矢',	
	'GBr' => '機槍彈藥',
	'GBi' => '氣體彈藥',
	'GBh' => '重型彈藥',
	'GBe' => '能源彈藥',
	'GB' => '手槍彈藥',	
	'M'=> '強化藥物',
	'ME'=> '強化藥物',
	'MH'=> '強化藥物',
	'N' => '無',	
	'PM' => '歌魂增加',
	'PT' => '歌魂恢復',
	'PR' => '怒氣增加',
	'PH' => '生命恢復',
	'PS' => '體力恢復',
	'PB' => '命體恢復',
	'p' => '禮物',
	'fy' => '全地圖唯一的野生浮雲禮物盒',
	'f99' => '【測】新格式福袋', # For test / Debug, uses new format that has $itmpara - will eventually be merged into existing formats.
	'ygo' => '卡包',
	//'R' => '探测仪器',	
	'ss' => '歌詞卡片',
	'T' => '陷阱',
	'U' => '掃雷設備',
	'V'=> '技能書籍',
	'VV'=> '技能書籍',
	'VS' => '技能書',
	'WN' => '空手',#空手
	'WGK' => '槍刃',#射+斩
	'WCF' => '符札',#投+符
	'WCP' => '重物',#投+殴
	'WKF' => '靈刃',#斩+符
	'WKP' => '重劍',#斩+殴
	'WFK' => '魔刃',#符+斩
	'WDG' => '巨炮',#爆+射
	'WDF' => '落魂',#爆+符
	'WJ' => '重型槍械',#JAVELIN
	'WP' => '鈍器',#PUNCH
	'WG' => '遠程兵器',#GUN
	'WK' => '鋭器',#KNIFE
	'WC' => '投擲兵器',#CAST
	'WD' => '爆炸物',#DETONATE
	'WF' => '靈力兵器',	#FLOWERING
	'WB' => '弓',	#BOW
	'WQ' =>'？？？？',
	'XA' =>'代碼殘片·綠',
	'XB' =>'代碼殘片·紫',
	'XC' =>'代碼殘片·黃',
	'XX' =>'殺意已決',
	'XY' =>'殺意未決',
	'X' => '合成專用',
	'Y' => '特殊',
	'ZA' => '代碼漏洞',
	'ZB'=> '稱號卡',
	'Z' => '特殊',#不可合并
    '🥚' => '代碼片段',
	'🎲' => '骰子',
	'🎆H' => '餘燼', #愈合数据
	'🎆V' => '餘燼', #熟练数据
	'🎆O' => '餘燼', #生命数据
	'🎆D' => '餘燼', #意念数据
	'🎆B' => '餘燼', #种火盒子
	'🎆C' => '餘燼', #种火盒子·报社篇
	'P🎆' => '餘燼', #霍霍完歌魂是不是还要霍霍种火数据（悲
	'🎆' => '餘燼', # Catch-All
	'💝' => '投射平台', // NPC/Player platform - uses its $itmpara for logic
);

$itemspkinfo = Array(
	'A' => '全系防禦',
	'a' => '屬性防禦',
	'B' => '傷害抹消',
	'b' => '屬性抹消',
	'C' => '防投',
	'c' => '重擊輔助',
	'D' => '防爆',
	'd' => '爆炸',
	'E' => '絕緣',
	'e' => '電擊',	
	'F' => '防符',
	'f' => '灼焰',
	'G' => '防彈',
	'g' => '同志',
	'H' => 'HP制御',
	'h' => '傷害制御',
	'I' => '防凍',
	'i' => '凍氣',
	'J' => '超量素材', 
	'j' => '多重',
	'K' => '防斬',
	'k' => '冰華',
	'L' => '致殘',
	'l' => '熱戀',
	'M' => '陷阱探測',
	'm' => '陷阱迎擊',
	'N' => '衝擊',
	'n' => '貫穿',
	'o' => '一發',
	'P' => '防毆',
	'p' => '帶毒',
	'q' => '防毒',
	'R' => '混沌',
	'r' => '連擊',
	'S' => '消音',
	's' => '調整',
	'U' => '防火',
	'u' => '火焰',
	'V' => '詛咒',
	'v' => '靈魂綁定',
	'W' => '隔音',
	'w' => '音波',
	'X' => '直死', //NPC专用
	'x' => '奇蹟',
	'y' => '破格', //属穿
	'Z' => '菁英',
	'z' => '天然',
	'-' => '精神抽取',
	'*' => '靈魂抽取',
	'+' => '技能抽取',
	'^' => '揹包',
	'🧰' => '工具',
	'🍎' => '水果',
	//'|' => '<:DUMMY:>', //箭矢用的分隔符
	//'🔰' => ' ', //判定物品已经被残想兵器改过名，用来干掉一些应该干掉的判定
);

//club20 元素大师：
$sparkle = '<span class="sparkle">✨</span>';
$elements_info = Array
(
	0 => $sparkle.'<span class="mtgcolorless">亮晶晶</span>'.$sparkle,
	1 => $sparkle.'<span class="mtgred">暖洋洋</span>'.$sparkle,
	2 => $sparkle.'<span class="mtgblue">冷冰冰</span>'.$sparkle,
	3 => $sparkle.'<span class="mtggreen">鬱萌萌</span>'.$sparkle,
	4 => $sparkle.'<span class="mtgwhite">晝閃閃</span>'.$sparkle,
	5 => $sparkle.'<span class="mtgblack">夜靜靜</span>'.$sparkle,
);
$r_elements_info = Array
(
	0 =>'<span class="mtgcolorless">亮晶晶</span>',
	1 =>'<span class="mtgred">暖洋洋</span>',
	2 =>'<span class="mtgblue">冷冰冰</span>',
	3 =>'<span class="mtggreen">鬱萌萌</span>',
	4 =>'<span class="mtgwhite">晝閃閃</span>',
	5 =>'<span class="mtgblack">夜靜靜</span>',
);
//NPC在躲避禁区、追杀玩家时不会进入的危险区（默认：无月之影、SCP、雏菊、英灵殿）
$deepzones = Array(0,32,33,34);
//安全箱位置
$depots = Array(5,28);
$shops = Array(0,14,27);
$hospitals = Array(11,19,32);
$plsinfo = Array(
	0=> '無月之影',
	1=> '端點',
	2=> 'RF高校',
	3=> '雪之鎮',
	4=> '索拉利斯',
	5=> '指揮中心',
	6=> '夢幻館',
	7=> '清水池',
	8=> '白穗神社',
	9=> '墓地',
	10=>'麥斯克林',
	11=>'對天使用作戰本部',
	12=>'夏之鎮',
	13=>'三體星',
	14=>'光坂高校',
	15=>'守矢神社',
	16=>'常磐森林',
	17=>'常磐台中學',
	18=>'秋之鎮',
	19=>'精靈中心',
	20=>'春之鎮',
	21=>'聖Gradius學園',
	22=>'初始之樹',
	23=>'幻想世界',
	24=>'永恆的世界',
	25=>'妖精驛站',
	26=>'鍵刃墓場',
	27=>'花菱商廈',
	28=>'FARGO前基地',
	29=>'風祭森林',
	30=>'天使隊移動格納庫',
	31=>'和田町研究所',
	32=>'SCP研究設施',
	33=>'雛菊之丘',
	34=>'英靈殿'
);
$hplsinfo = Array
(
	# 隐藏地点列表。位于哪组隐藏地点是通过使用players表内字段'pgroup'判断的。隐藏地点的编号不能与标准地点编号重复。
	# 0是标准地图组。另附：254号被我用来扔销毁过的尸体了……如果登记成一个地图的话，倒也不会在里面摸到尸体，但是……怎么说呢……阴气太重了！
	# TODO：还有一个大工程没做：只能听到同一地图组内的声音信息。现在先偷懒设置成隐藏地图内不会产生声音了。
	1 => Array
	(
		101 => '測試地圖1A',
		102 => '測試地圖2A',
		103 => '測試地圖3A',
	),
	2 => Array
	(
		111 => '測試地圖1B',
		112 => '測試地圖2B',
		113 => '測試地圖3B',
		114 => '測試地圖4B',
	),
);
$xyinfo = Array(
	0=>'B-2',
	1=>'A-6',
	2=>'H-3',
	3=>'B-6',
	4=>'F-10',
	5=>'D-6',
	6=>'H-6',
	7=>'F-3',
	8=>'E-10',
	9=>'J-4',
	10=>'I-8',
	11=>'D-8',
	12=>'F-9',
	13=>'H-4',
	14=>'H-8',
	15=>'G-1',
	16=>'I-2',
	17=>'A-5',
	18=>'G-4',
	19=>'D-4',
	20=>'I-7',
	21=>'F-7',
	22=>'J-6',
	23=>'A-8',
	24=>'C-9',
	25=>'D-2',
	26=>'A-1',
	27=>'F-8',
	28=>'E-1',
	29=>'F-5',
	30=>'F-6',
	31=>'J-1',
	32=>'J-2',
	33=>'F-4',
	34=>'J-10',
	'hidden'=>'■-■',
);
$areainfo = Array
	(
	0=>"充滿了靈力的永久禁區，也是整個戰場的入口。<br>逗留在這裏也許會被時空吞噬……<br><span class=\"yellow\">買完東西就快點離開吧。</span><br>",
	1=>"藍白色的大地上彷彿有種令人心悸的波動在迴盪。<br>還是快離開吧。<br>",
	2=>"這是一所位於郊區的高校。<br>之前畢業旅行的學生似乎遇到了慘烈的交通事故，倖存的學生們大概接受心理疏導去了吧。<br>",
	3=>"飄着雪花的北國小鎮，俄羅斯風格的建築使人愈發感到寒冷。<br>",
	4=>"柔軟的大地不斷變化，在人眼前生長成巨大而詭異的形狀，然後在海水的沖刷下四散崩潰。<br>這究竟是什麼地方？<br>",
	5=>"海風的腥味表明這幢建築似乎是從某個島嶼上移動過來的。<br><span class=\"yellow\">自動防禦系統還在忠實地工作着，看來需要隨時保持警惕。</span><br><span class=\"sienna\">這裏似乎有一個能夠寄放物品的神奇箱子……</span><br>",
	6=>"建築裏外都充滿了向日葵的香味，然而四處散佈的妖怪氣息依然讓人不寒而慄。<br><span class=\"yellow\">自動防禦系統還在忠實地工作着，看來需要隨時保持警惕。</span><br>",
	7=>"各種各樣的雕像環繞着一個歐式的大水池。<br>池水十分清澈，也許可以直接飲用。<br>",
	8=>"神社空無一人。<br>但是，在這裏仰望天空的話，總覺得會被某種憂傷的思緒所感染。<br>",
	9=>"這裏埋葬着很多被當做祭品殺死的怪獸。<br>不知道是怎樣奇怪的召喚儀式呢……<br>",
	10=>"一踏入這裏，身軀就覺得沉重，而且氣壓也好像陡然增加了許多。<br>大概是個不宜久留的地方。<br>",
	11=>"充滿了各種誇張的陷阱的房間，似乎是某所高校的校長室。<br><span class=\"yellow\">在這裏，似乎不管受到怎樣的傷害也會很快回復。</span><br>",
	12=>"灑滿了陽光的靠海的村莊，青色的天空吸引人久久凝望、不能罷懷。<br>",
	13=>"這裏連時令都錯亂了麼？<br>不僅晝夜錯亂、忽冷忽熱，有時甚至有兩三個太陽同時升起……<br>",
	14=>"長長的坂道的盡頭是一所學校。<BR>學校規模不小，但總給人寂寥無人之感。<br><span class=\"yellow\">從校內的自動售貨機似乎能買到些什麼。</span><br>",
	15=>"高大的御柱環繞在山中湖泊周圍。儘管景色美麗，卻找不見本應在此的巫女。<br>",
	16=>"濃郁的樹葉遮住了陽光，是容易被襲擊的地方啊……<br>林間不時還有奇怪的生物出沒……<br>聽説這附近每隔十年都會有超能力者誕生。<br>",
	17=>"不同於現世的先進設備兀自運轉着，令人覺得是不是來到了某個技術先進的域外之城。<br><span class=\"yellow\">自動防禦系統還在忠實地工作着，看來需要隨時保持警惕。</span><br>",
	18=>"與其他住宅區相比，這裏的商店特別多。<BR>雖然如此，整個城市瀰漫着一種莫名的悲傷的氣氛……<br>",
	19=>"巨大的建築物內，不知名的設備依然在運轉。<br>根據殘缺不全的説明，<span class=\"yellow\">也許這些機器可以為人治療傷口和恢復精力？</span><br>",
	20=>"儘管處於春季，也無法掩飾衰敗的蕭條小鎮。<br>逗留在這裏總使人感到命運無情……<br>",
	21=>"表面上看去像是標準的貴族女校，<br>有着與學校不相稱的停機坪和地下倉庫。<br>",
	22=>"在綠地上孤零零矗立的大樹，像是一座紀念碑。<BR>這到底意味着什麼呢？<br>",
	23=>"被白雪籠罩，一片荒蕪的空間……<BR>時空錯亂了嗎？為什麼我會在這裏？<br>",
	24=>"詭異的地方……腳下已經看不見什麼地面了……<BR>這個地方究竟是什麼？<br>",
	25=>"一間孤獨的小屋子。<br>貌似沒有人住在這裏了。<br>門上貼着告示：<br>TRAIN WITH MY HOLOGRAM IF YOU WANT TO --- GA-04<br>",
	26=>"代表火與血的犧牲的曾經的戰場。<BR>冰封的力量已經不在。<br><span class=\"yellow\">你仍然感覺到一股蒼涼的殺氣！是你的錯覺麼！</span><br>",
	27=>"荒廢的都市裏，頂層有着天象館的廢棄商場。<BR>雖然大部分區域都停電了，<span class=\"yellow\">角落裏的自動售貨機似乎還能運行。</span><br>",
	28=>"現在已經是一團廢墟的遺蹟。<BR>可能能找到有用的物品也説不定。<br><br><span class=\"sienna\">這裏似乎有一個能夠寄放物品的神奇箱子……</span><br>",
	29=>"傳説有神秘力量的森林。<BR>誰知道這個地方會出現什麼。<br>",
	30=>"在遠處看這個建築你還以為那是一個集裝箱，<BR>走進去以後才發現這裏別有洞天。<br>龐大的電腦系統正在忠實地工作着。<br>",
	31=>"最近突然在地平線遠端出現的大型建築，<BR>你注意到建築的後院時空裂縫之外貌似還有一個小鎮……<br>",
	32=>"最近突然在地平線遠端出現的第二座大型建築，<BR>感覺有種不祥的氣息……<br>",
	33=>"風祭森林的最深處。<BR>被盛開的雛菊花覆蓋着的山丘。<BR>山丘上貌似有個身影坐着，<BR>還是離她遠一點為妙。<BR>",
	34=>"總而言之這裏就是英靈殿了。<BR>",
	101 => '位於狹窄甬道兩側的燈光隨着你的步調依盞亮起……又在你身後悄然熄滅。回過神來時，你已置身於一片黑暗中了。<BR>',
	102 => '空曠的大廳內，零星豎立着幾根殘破不堪的支撐柱。<BR>不知是不是錯覺……你感到有什麼東西隱藏在立柱背後的陰影裏。<BR>',
	103 => '敞開的穹頂從夜空接引下一束清冷月光。<br>在月光映照下，你的前方已是一片坦途。<br>',
);



$dinfo = Array(
	10 => '不知道什麼原因，你死去了。<br>這應該是一個BUG，請通知管理員。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】所以説這是什麼意思？</span><br><span class="blueseed">【Ｐ】這大概是上層敍事的鍋，死亡方法沒配上正確的回覆，按照系統説的做吧。</span><br><span class="redseed">【Ｅ】所以説我們在這裏的意義是？</span><br><span class="blueseed">【Ｐ】就算是上層敍事，人也是會犯錯誤的嘛，也有人會好奇看代碼倉庫呢對吧。</span><br><span class="redseed">【Ｅ】行吧，那就這樣，屏幕這邊的你記得去彙報給冴冴！快去！</span><br></div>',
	11 => '“滴滴滴——”<br>這是……手機鬧鈴的提示音？<br>“糟糕！還沒確認這次的禁區情況——”<br>還沒等你有所反應，死神一般的空間裂縫已經把你吞沒了。<br>等待你的只有死亡……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】唔……我得説這是個時間管理問題……</span><br><span class="redseed">【Ｅ】這個遊戲中，「進行狀況」頁面會有禁區的提示。</span><br><span class="blueseed">【Ｐ】而且紅暮和藍凝在每個禁區到來前也會進行播報。</span><br><span class="redseed">【Ｅ】話説她們兩個在這點上怎麼對玩家這麼好，玩家死的快一點對她們不是好事麼？</span><br><span class="blueseed">【Ｐ】誰知道呢……</span><br></div>',
	12 => '“嗚……到此為止了嗎……”<br>毒素造成的痛苦讓你無法再堅持下去了。<br>你吐出嘴裏最後一點深黑的血液，仰面倒了下去。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】啊呀呀……這是中毒死了呢……</span><br><span class="redseed">【Ｅ】中毒以後最直觀的方法便是找「解毒劑」吃，商店也有賣。</span><br><span class="blueseed">【Ｐ】中了毒就別死撐着了，因為探索和移動都會造成相當的傷害。</span><br><span class="redseed">【Ｅ】而且中毒時如果再被毒屬性的攻擊打到，便是屋漏恰逢連夜雨，受到額外的傷害呢。</span><br><span class="blueseed">【Ｐ】順便一提，也可以使用技能點來解毒，某個社團更可以直接通過點擊界面上中毒（POISONED）的字樣進行解毒呢！</span><br></div>',
	13 => '“不好！”<br>也許在平時的你看來，這只是小菜一碟……<br>但對於此刻遍體鱗傷的你來説，<br>眼前的突發狀況無異於壓垮駱駝的最後一根稻草。<br>你不甘心地倒下了，再也沒有起來。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】這就叫做……量變造成質變。</span><br><span class="blueseed">【Ｐ】這遊戲中的即死外事件對你應該只會造成輕微傷害。</span><br><span class="redseed">【Ｅ】但就算傷害再輕微，也會成為壓垮犯下決定性錯誤的你的稻草。</span><br><span class="blueseed">【Ｐ】所以你得要記着了，時刻保證你的生命值，以免再度陰溝翻船。</span><br><span class="redseed">【Ｅ】只能祝你下次好運呢。</span><br></div>',
	14 => '“也許咱應該斷定你上網成癮？”<br>這是……林無月的聲音！<br>從哪裏傳來的？<br>她怎麼會知道我試圖入侵虛擬世界的控制系統？<br>還沒等你反應過來，你就兩眼一黑，什麼都不知道了。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】這裏有個福利，你最好記住了——</span><br><span class="blueseed">【Ｐ】遊戲中一般情況下PC解禁的成功率是六成來着。</span><br><span class="redseed">【Ｅ】但在這之外，如果骰子出了大失敗，那麼你就會掛點，就像現在這樣。</span><br><span class="blueseed">【Ｐ】如果不想再度碰見這種情況，就找個「錫安組織」的稱號的玩家幫你解禁吧。</span><br><span class="redseed">【Ｅ】而且這個稱號解禁的成功率也會大幅度提高哦。<br></div>',
	15 => '“我很抱歉，不過這是林無月的意思。”<br>面前突然出現的，是一個陌生男子。<br>這人説些什麼怪話呢？<br>你正要上前問個究竟，只見男子手中白光一閃，你的意識就此煙消雲散。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】這個……沒啥説法呢。</span><br><span class="blueseed">【Ｐ】某個上位存在的GM在後台管理中將你幹掉了。</span><br><span class="redseed">【Ｅ】我覺得肯定是有原因的吧。</span><br><span class="blueseed">【Ｐ】但這不是我們應該決斷的事情。</span><br><span class="redseed">【Ｅ】那麼我們也就閉嘴了。</span><br></div>',
	16 => '“…………”<br>我是誰，我在哪裏？<br>你焦急地尋找着你存在過的痕跡。<br>但似乎一開始就沒有什麼東西在那裏。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】這個……沒啥説法呢。</span><br><span class="blueseed">【Ｐ】屍體倒是不會憑空消失，大概是哪個人將你的屍體銷燬了吧。</span><br><span class="redseed">【Ｅ】我覺得肯定是有原因的吧。</span><br><span class="blueseed">【Ｐ】但這不是我們應該決斷的事情。</span><br><span class="redseed">【Ｅ】總之大俠請下局重新來過吧。</span><br></div>',
	17 => '“嗚……到此為止了嗎……”<br>身體已被冰雹砸得千瘡百孔，傷痛讓你無法再堅持下去了。<br>你腳下一軟，向前栽倒，失去了意識。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】人喲，為何要挑戰自然天象……</span><br><span class="redseed">【Ｅ】別看冰雹一次可能就這麼點傷害，其實是按照比率扣血的。</span><br><span class="blueseed">【Ｐ】沒有補給的話，動十幾次你就很危險了，就像這樣。</span><br><span class="redseed">【Ｅ】還是躲起來等禁區或者找改天氣的道具吧。</span><br><span class="blueseed">【Ｐ】或者你自認為血條比較長或者補給比較多，也可以硬抗，但我們也不知道你是不是就是因為沒抗住才變成這樣的呢？</span><br></div>',
	18 => '“嗚……到此為止了嗎……”<br>燒傷導致的傷痛讓你無法再堅持下去了。<br>你腳下一軟，向前栽倒，失去了意識。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】你可能會覺得，火燒燬一切，也讓你落了命，實在是令人不爽。</span><br><span class="redseed">【Ｅ】但對於我們來説，火是生命的化身。</span><br><span class="blueseed">【Ｐ】唔，我們扯遠了，總之燒傷你需要找「燒傷藥劑」，或者使用技能點治療。</span><br><span class="redseed">【Ｅ】也可以在能躺的地方進行「靜養」一段時間。</span><br><span class="blueseed">【Ｐ】某個社團也可以直接點擊界面上的燒傷（BURNED）狀態進行解除。</span><br></div>',
	20 => '一切……都結束了吧……<br>你無力地倒在地上，<br>眼睜睜地看着血液從致命的傷口噴湧而出。<br>一個揮舞雙拳的身影，在你失神的瞳孔中逐漸淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】拳法家在哪裏都是天下無敵呢！</span><br><span class="redseed">【Ｅ】畢竟這個遊戲中其實不存在〔防拳〕的道具，他們可以簡單地撕裂你〔全系防禦〕的高級裝備。</span><br><span class="blueseed">【Ｐ】而且拳頭直接拿毆系熟練度以及基礎攻擊力的數值做公式計算，可以打出更為穩定可觀的傷害。</span><br><span class="blueseed">【Ｐ】所以下次回來的時候，不妨練練拳頭吧？</span><br></div>',
	21 => '一切……都結束了吧……<br>你無力地倒在地上，<br>眼睜睜地看着血液從致命的傷口噴湧而出。<br>一個緊握鈍器的身影，在你失神的瞳孔中逐漸淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】不知道你是不是被釘棍棒打死的呢？</span><br><span class="blueseed">【Ｐ】畢竟這玩意可是原版大逃殺中的名物之一。</span><br><span class="redseed">【Ｅ】總之，給棍棒打釘子後，能打出相當可觀的傷害。</span><br><span class="blueseed">【Ｐ】此外，如果毆系武器上有〔電擊〕屬性，更能打出額外的加成。</span><br><span class="redseed">【Ｅ】下次回來的時候想發展毆系的話，就去找電擊屬性的毆系武器吧，『FARGO前基地』似乎有不錯的。</span><br></div>',
	22 => '一切……都結束了吧……<br>你無力地倒在地上，<br>眼睜睜地看着血液從致命的傷口噴湧而出。<br>一個腰佩刀劍的身影，在你失神的瞳孔中逐漸淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】這是被斬殺了呢。</span><br><span class="blueseed">【Ｐ】斬繫有穩定的「磨刀石」強化手段，並且很容易讓對手受傷。但傷害浮動巨大，也很吃武器耐久。</span><br><span class="redseed">【Ｅ】而且，〔帶毒〕的斬系屬性更會打出額外的傷害。</span><br><span class="blueseed">【Ｐ】所以，想玩斬系的話，不妨開局去『精靈中心』弄點針筒，和毒藥合成毒針吧。</span><br><span class="redseed">【Ｅ】而且毒針可以進一步通過合成強化，不會虧的；此外，毒性，「黑衣組織」，嗯……</span><br></div>',
	23 => '一切……都結束了吧……<br>你無力地倒在地上，<br>眼睜睜地看着血液從致命的傷口噴湧而出。<br>一個扛着槍械的身影，在你失神的瞳孔中逐漸淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】砰！午時已到！</span><br><span class="redseed">【Ｅ】射系的射程自然是最高的，不管是攻擊還是壓制都十分出色。</span><br><span class="blueseed">【Ｐ】如果説弱點的話，那就是要根據槍械類型使用不同的子彈，並且子彈打光就不好用了。</span><br><span class="blueseed">【Ｐ】想玩射系的話，就記好了：火焰和冰凍需要「壓縮氣罐」，而電擊和音波需要「槍械電池」，連擊的機槍自然需要「機槍子彈」！</span><br></div>',
	24 => '一切……都結束了吧……<br>你無力地倒在地上，<br>眼睜睜地看着血液從致命的傷口噴湧而出。<br>一個手持投擲武器的身影，在你失神的瞳孔中逐漸淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】暴扣！</span><br><span class="blueseed">【Ｐ】雖然投系的傷害成長比較低，命中率可是最高的呢。</span><br><span class="redseed">【Ｅ】投系每次攻擊會消耗武器耐久，但是大部分投系武器都是無限耐久的。</span><br><span class="blueseed">【Ｐ】只要你掄圓胳膊，投擲武器的也是能扔很遠。雖然沒有子彈距離長，但是足夠對付那些近戰武器了。</span><br><span class="redseed">【Ｅ】想試試投系嗎？去找一找小黃的服裝，嘗試合成精靈球吧。</span><br></div>',
	25 => '一切……都結束了吧……<br>你無力地倒在地上，<br>眼睜睜地看着血液從致命的傷口噴湧而出。<br>一個手持爆炸物的身影，在你失神的瞳孔中逐漸淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】被伏擊了嗎？即使你的武器再強，面對突然襲擊也無能為力呀。<br><span class="blueseed">【Ｐ】爆系最招牌的就是發動敵人無法反擊伏擊和高額的爆炸傷害。</span><br><span class="redseed">【Ｅ】即使伏擊很強，炸藥包和絆雷也無法反擊敵人呢。</span><br><span class="blueseed">【Ｐ】打算玩爆系的，就去找一找輕油和肥料吧。這倆合成的火藥，可是爆系的精髓呢。</span><br></div>',
	26 => '“這味道……不對！”<br>飢渴難耐的你才咬了一口手中的補給品，就覺得不對勁。<br>然而，你發現得太晚了……<br>劇毒在幾秒鐘之內就奪去了你的生命。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】喂喂喂，不是所有東西都是可以吃的呀。</span><br><span class="blueseed">【Ｐ】看上去不能吃的，比方説氯化氫，天然氣，就趕快丟掉吧。</span><br><span class="redseed">【Ｅ】看上去能吃的，也有概率帶毒，比如橘黃色的果醬，電子壽司。</span><br><span class="blueseed">【Ｐ】如果實在拿不準的話，水，杏仁豆腐，壓縮餅乾都是無毒的。</span><span class="redseed">【Ｅ】對了，某個社團也可以檢查食物是否帶毒哦。</span><br></div>',
	27 => '“什麼！這裏竟然……”<br>沒能留意到陷阱的你，只能眼睜睜看着轟然啓動的陷阱無情地撕碎你的身軀。<br>“啊啊……這是……哪個混蛋……”<br>你的雙眼被鮮血永遠地掩蓋了。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】百密一疏啊。敵人，可不只會出現在眼前。時刻留意腳下，小心那些地雷和落穴。</span><br><span class="redseed">【Ｅ】試試防禦姿態吧，提高防禦值能有效降低陷阱傷害。</span><br><span class="blueseed">【Ｐ】另外，也有一些裝備上帶有「陷阱探測」，「陷阱迎擊」等屬性，它們能幫你抵禦這些陷阱。</span><br><span class="redseed">【Ｅ】經常跟陷阱打交道的社團，往往更有經驗呢，下次不妨試試選它吧。</span><br></div>',
	28 => '你被很奇怪的事情奪去了生命。<br>也許這跟一個名叫夜什麼月的人有一星半點的關係。<br>具體情況請參見遊戲狀況。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】這是……死亡筆記！？</span><br><span class="redseed">【Ｅ】唔，這是極強力的道具呢，能在瞬間之內抹殺玩家，好像……■cF■n創始人身上也帶着它。</span><br><span class="blueseed">【Ｐ】被筆記抹殺了，還是等待下一局吧。風水輪流轉，説不定會時來運轉呢！</span><br></div>',
	29 => '一切……都結束了吧……<br>你無力地倒在地上，<br>眼睜睜地看着血液從致命的傷口噴湧而出。<br>一個攥着符札的身影，在你失神的瞳孔中逐漸淡去……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】Icicle Fall！現在誰是笨蛋了啊！</span><br><span class="blueseed">【Ｐ】雖然距離非常短，但是獨特傷害機制使得靈系的部分傷害可以無視防禦直接攻擊到敵人。</span><br><span class="redseed">【Ｅ】靈系的缺點是在攻擊時會發出靈氣，容易暴露位置；造成傷害的同時還會消耗體力。</span><br><span class="blueseed">【Ｐ】spell card是靈系最常見的武器類型。守矢神社和商店都有合成符卡的基礎素材：空白符卡。</span><br><span class="redseed">【Ｅ】嘗試藉助遊戲幫助合成一些符卡吧！</span><br></div>',
	30 => '好奇心果然殺死貓啊……<br>你勉強支起破碎的身軀，<br>看着那個你剛才按下的帶按鈕的小盒子無奈地笑着。<br>這真是殘酷的惡作劇啊。<br>你的意識逐漸模糊了……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】喔，這可是能毀壞幻境的大殺器啊，怎麼能亂摁呢？</span><br><span class="redseed">【Ｅ】不管怎麼樣，按下這個按鈕會引發一些不可預估的事情。按之前一定要三思！</span><br></div>',
	31 => '注射器裏的藥液才打進一半，你就覺得身體有異樣。<br>“脖子……好癢……”<br>你瘋狂地摳着脖子上的淋巴腺，<br>很快就倒在動脈破裂而流出的血泊中……<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】啊喂，這種奇奇怪怪的藥劑你也敢打嗎，這可是自殺藥啊！</span><br><span class="blueseed">【Ｐ】聽説……好像有一個人……打完之後竟然沒死呢。</span><br><span class="redseed">【Ｅ】當然，你要真的是為了自殺而打，就當我們沒説吧。</span><br></div>',
	32 => '“就躲在這裏，讓那些人自相殘殺去吧。”<br>你正打着自己的小算盤，卻被一聲怒喝打斷了。<br>“來人，這裏有個掛機黨！”<br>你驚愕地看着不知從哪裏冒出來的玩家們把你團團圍住。<br>“浪費時間，快去死吧！”<br>之後的事情，就太獵奇了……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】掛機判定時長是30分鐘，記得定時移動。</span><br></div>',
	33 => '“對不起、對不起！能讓我迫降一下嗎？”<br>勉強躲過彈幕的你，忽然聽到頭上傳來這樣焦急的道歉聲。<br>少女的迫降……？莫非是指……<br>少女嬌柔的話音讓你放鬆了警惕。<br>還沒等你反應過來，少女——以及她乘坐的、幾十噸重的機體——便把你的整個世界壓得粉碎……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】啊，這個組織「G」時常會出任務呢。</span><br><span class="redseed">【Ｅ】下次鬧出動靜來還是不要久留了吧。</span><br></div>',
	34 => '將手中的溶劑一飲而盡之後，你感到全身就像燃燒起來一樣。<br>“沒錯，我需要的就是這種力量！”<br>然而，當你看到自己像奶油般融化了的手掌在地上撲騰的時候，你才發現這場豪賭押錯了邊。<br>“那麼，你就燃燒殆盡吧。”在意識崩解前，傳來了一個女聲的嘆息。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】從奇異的存在上提取出的藥劑，自然帶有不可想象的力量。</span><br><span class="blueseed">【Ｐ】喝下藥水之前，確保自己已經考慮過後果。</span><br><span class="redseed">【Ｅ】謹記，力量需要代價，貪慾帶來毀滅。</span><br></div>',
	35 => '在你失去意識之前，你彷彿聽到了一個冰冷的聲音。<br>“像你這樣的Homo-Speculator……”<br>“……真是最差勁的個體了”<br>然後，你看着你的身體和意識在一道聖光中溶解了。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】有一些遊蕩着的危險存在……它們會根據你的rp判定弄死你……</span><br><span class="redseed">【Ｅ】rp……可以通過儀水鏡來查看。</span><br><span class="blueseed">【Ｐ】這種地方，還是不要久留了吧……</span><br></div>',
	36 => '你徒勞地想掙脱絲帶的束縛，<br>但是從絲帶上傳來的巨大壓力，簡簡單單地將你一分兩半。<br>真是雜魚一樣的死法……<br><br><div class="seedhint">………………<br>…………<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】是鍵……？</span><br><span class="redseed">【Ｅ】被腰斬了啊。</span><br><span class="blueseed">【Ｐ】當你rp過高的時候，會被腰斬。為何不嘗試一下觸發陷阱來減少RP呢？</span><br><span class="redseed">【Ｅ】想去【雛菊之丘】的話，最好多踩幾個地雷呢。</span><br></div>',
	37 => '你徒勞地想躲避絲帶，<br>但是説時遲那時快，你發現你的頭正在骨碌碌地往山腳下滾去。<br>真是雜魚一樣的死法……<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】被鍵救濟了呢。</span><br><span class="redseed">【Ｅ】鍵的救濟跟rp相關。它是遊戲裏一個隱藏變量，正式名稱為「報應點數」（Retribution Point）。</span><br><span class="blueseed">【Ｐ】減少rp的辦法？可以嘗試合成【風祭河水】飲用。</span><br><span class="blueseed">【Ｐ】注意，雖然風祭河水能有概率清空rp，但是會有極小的概率被鍵救濟！</span><br></div>',
	38 => '你成功地躲避了絲帶，<br>沒想到從絲帶中竟然噴出了岩漿！<br>你的意識在烈火中消失了。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】……鍵？</span><br><span class="blueseed">【Ｐ】唔，被救濟了呢。</span><br><span class="redseed">【Ｅ】救濟的判定跟你的rp相關，rp主要通過擊殺NPC來積累，遭遇一些事件也會增加rp。</span><br><span class="blueseed">【Ｐ】出現事件後還是離遠點吧。</span><br></div>',
	39 => '“去死吧！就算你是權限[嗶]也擋不住我這一擊的！”<br>你狂笑着使出你自認為決定勝負的一擊，噗通倒下的卻是你自己。<br>“不，這不科學！”被武器背叛的你遁入了無盡的黑暗中。<br><br><div class="seedhint">………………<br>…………<br><span class="blueseed">【Ｐ】越是強大的武器，越是有使用的風險。</span><br><span class="redseed">【Ｅ】越是濃厚的殺意，會帶來越大的反噬。</span><br><span class="blueseed">【Ｐ】幻境自有其制衡之道，逾矩會帶來無法想象的後果。</span><br><span class="redseed">【Ｅ】幫助上只説會必殺，可沒説殺的是哪一方哦。</span><br></div>',
	40 => '“看起來好像沒什麼反應嘛……那是！！”<br>天空中突然降下的巨大柱狀物瞬間將你的世界吞沒。<br>你眼前一黑，便失去了意識。<br><br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】是那位神靈啊，幹嘛要招惹她呢？</span><br><span class="blueseed">【Ｐ】使用她的符卡，後果自負喲。</span><br></div>',
	42 => '你摁下了手中的玩具般的按鈕。<br>面前憑空出現了一扇閃光的門扉！<br>你毅然決然地踏了進去……<br>………………<br>…………<br>……<br>隨着你獨自摘下了VR設備站起身來，你鬆了一口氣。<br>雖然其他的玩家還在這場遊戲中冒死廝殺，但起碼你自己毫髮無傷地逃出了生天。<br>雖然這怎麼説都無法讓你成為勝利者，但就這一點本身，已經算是不錯的成就了。<br>你回頭看了一眼正顯示着你所謂的死亡信息的屏幕，不禁笑了起來……<br><br>＝＝＝＝＝＝＝＝＝<br><span class="lime">獨自逃脱成功！<br>你獲得了20積分獎勵！勝場+1！</span><br>＝＝＝＝＝＝＝＝＝<br>',
	44 => '在你想着要獲取更大，更多的力量時。<br>你沒想到這將讓你的身體承擔不起。<br>在你身體裏面肆虐的<span class="glitchb">數據風暴</span>終於無法制御，<br>從你的體內破體而出……<br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】這裏有個教訓——</span><br><span class="blueseed">【Ｐ】在使用所謂的第三方庫之前，最好先將它的底細摸清楚……</span><br><span class="redseed">【Ｅ】要説明白的話，那這個「🥚」其實並不是林氏出品的東西……</span><br><span class="blueseed">【Ｐ】總之，下次注意點吧！</span><br></div>',
	45 => '你懷着必死的決心，向你的對手撞了上去，<br>絲毫未注意到<span class="glitchb">數據風暴</span>穿體而出所帶來的疼痛。<br>各種顏色的<span class="glitchb">數據風暴</span>圍繞着你們，<br>當一切結束後，戰場上已經是一片狼藉……<br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】熱血漫畫固有戲碼——自爆！</span><br><span class="blueseed">【Ｐ】這是你自己的選擇，我們也不評價了。</span><br><span class="redseed">【Ｅ】希望被你幹掉的人值得你這麼做。</span><br><span class="blueseed">【Ｐ】那麼下次再見！</span><br></div>',
	50 => '你的身體化作了天邊的紅霞。<br>想必會為虛擬幻境中的各位帶來笑容吧。<br><div class="seedhint">………………<br>…………<br><span class="redseed">【Ｅ】…………………………？</span><br><span class="blueseed">【Ｐ】……………………。</span><br></div>',
	60 => '一切……都結束了吧……<br>你無力地倒在地上，<br>眼睜睜地看着血液從致命的傷口噴湧而出。<br>一個手持弓箭的身影，在你失神的瞳孔中逐漸淡去……<br><br>',
);

$syschatinfo = Array(
	'hack' => Array(
		Array('r0','紅暮','哼，真有兩下子……等下次禁區自動恢復好了。'),
		Array('r0','紅暮','大膽狂徒，再敢這樣做小心我直接改你的RP值。'),
		Array('r0','紅暮','滿是雪花的屏幕還真讓人心煩。'),
		Array('r0','紅暮','禁區失效了。如果是衝我而來，那麼我奉陪。'),
		Array('b0','藍凝','禁區被解除了？……'),
		Array('b0','藍凝','似乎可以從顯示屏上看出彈幕來……'),
		Array('b0','藍凝','咦？不是吧！我不過灑了點水在控制枱上而已……'),
	),
	'rdown' => Array(
		Array('b0','藍凝','剛才那聲音是……難道？'),
		Array('b0','藍凝','...Engage, Rage mode-魔法特工 蒼藍☆亂舞！'),
	),
	'bdown' => Array(
		Array('r0','紅暮','你們對我妹妹做了什麼！？'),
		Array('r0','紅暮','凝醬……是嘛，看來有礙事的傢伙出現了。'),
	),
	'areawarn20' => Array(
		Array('r0','紅暮','咳咳，那麼下面播報禁區警告——'),
		Array('r0','紅暮','真有趣，如果不提示，會有多少人陰溝裏翻船呢？'),
		Array('r0','紅暮','廣播系統好像有點失靈？拖個人來修一下吧。'),
		Array('b0','藍凝','這裏是……警報。'),
		Array('b0','藍凝','NOW THE ALARM.'),
	),
	'areawarn40' => Array(
		Array('r0','紅暮','白熱化！連鬥階段真是美麗啊。'),
		Array('r0','紅暮','再過不久就要決出勝者了呢。'),
		Array('r0','紅暮','似乎還留着幾個重要地點，真遺憾。'),
		Array('r0','紅暮','那邊的職人，對就是你們幾個，沒死的話過來幫忙把這個陷阱挪走。'),
		Array('b0','藍凝','……差點忘了……'),
		Array('b0','藍凝','啊～真無聊……呃，在、在播報啊，現在是警報時間——'),
		Array('r1b0','藍凝','那傢伙撤退了，我得加油……'),
	),
	'areaadd20' => Array(
		Array('r0','紅暮','聽啊，那喪鐘為誰而鳴？'),
		Array('r0','紅暮','現在增加禁區。'),
		Array('r0','紅暮','各位好，這裏是紅殺頻道，我們先來看看本期的禁區死亡名單——'),
		Array('r0b0','紅暮','就這幾個人麼……凝醬，你怎麼看？'),
		Array('b0','藍凝','禁區時間到！'),
		Array('b0','藍凝','好像只要撳按鈕就可以了。'),
		Array('b0','藍凝','GENOCIDE IS COMING.'),
	),
	'areaadd40' => Array(
		Array('r0','紅暮','現在死掉就沒法投幣了哦！'),
		Array('r0','紅暮','正在奮戰的各位辛苦了，下面給你們派發便當。'),
		Array('r0','紅暮','各位好，現在戰鬥已經進入高潮，我們來看看這次的禁區死亡名單——'),
		Array('r0b1','紅暮','就用你們的血為凝醬報仇雪恨！'),
		Array('b0','藍凝','DEVILRY IS COMING.'),
		Array('b0','藍凝','按鍵無效啊，那麼看我的720度迴旋斜踢電器維修法！咣——'),
		Array('r1b0','藍凝','不會讓那傢伙失望的……'),
	),
	'end1' => Array(
		Array('r0b0','紅暮','沒有結果呢。凝醬，準備『下一輪』吧。'),
		Array('r0b0','紅暮','預想之中。那麼，凝醬，我們從這裏撤離吧。'),
		Array('b0','藍凝','這局真無聊啊。'),
		Array('r1b0','紅暮','看來我死得毫無價值呢。凝醬，準備『下一輪』吧。'),
		Array('r1','紅暮','看來我死得毫無價值呢。那麼，你們就永遠留在這裏吧。'),
		Array('b1','藍凝','……真遺憾呢。'),
	),
	'end2' => Array(
		Array('r0','紅暮','決出勝負了。歡迎來到勝者的世界。'),
		Array('r0','紅暮','竟然是你……不，並沒有別的意思。祝賀你，獲勝者。'),
		Array('b0','藍凝','正統派的結局麼……'),
		Array('r1','紅暮','於是似乎碰到了不按牌理出牌的傢伙呢。'),
		Array('b1','藍凝','...'),
	),
	'end3' => Array(
		Array('r0','紅暮','咦，我還活着？這不科學！'),
		Array('r1','紅暮','哼……竟然遇到愚蠢到出手反抗的傢伙了啊。'),
		Array('r1','紅暮','你覺得你真的能逃脱麼？'),
		Array('r1','紅暮','那就讓你達成所謂的HAPPY ENDING吧，呵呵呵……'),
		Array('r1b1','紅暮','看來還真是心狠手辣的傢伙，我會記住的。'),
		Array('r1b1','紅暮','看來還真是心狠手辣的傢伙，我會記住的。'),
		Array('b0','藍凝','正統派的結局麼……'),
		
		Array('b1','藍凝','...'),
	),
);

/*Infomations*/
$_INFO = Array(
	'reg_success' => '註冊成功！請返回首頁登陸游戲。',
	'pass_success' => '修改密碼成功。',
	'pass_failure' => '未修改密碼。',
	'data_success' => '接受對帳户資料的修改。',
	'data_failure' => '未修改帳户資料。',
	'credits_conflicts' => '轉換衝突，請勿同時轉換不同類型積分。',
	'credits_success' => '積分轉換成功。',
	'credits_failure' => '積分轉換失敗，請檢查輸入。',
	'credits_failure2' => '積分轉換失敗，請勿輸入過大的數字。',
	'credits_failure3' => '積分轉換失敗，轉換戰鬥力時請輸入100的倍數。',
);

/*Error settings*/
$_ERROR = Array(
	'db_failure' => '數據庫讀寫異常，請重試或通知管理員',
	'name_not_set' => '用户名不能為空，請檢查用户名輸入',
	'name_too_long' => '用户名過長，請檢查用户名輸入',
	'name_invalid' => '用户名含有非法字符，請檢查用户名輸入',
	'name_banned' => '用户名含有違禁用語，請檢查用户名輸入',
	'name_exists' => '用户名已被註冊，請更換用户名',
	'pass_not_set' => '密碼不能為空，請檢查密碼輸入',
	'pass_not_match' => '兩次輸入的密碼不一致，請檢查密碼輸入',
	'pass_too_short' => '密碼過短，請檢查密碼輸入',
	'pass_too_long' => '密碼過長，請檢查密碼輸入',
	'ip_banned' => '此IP已被封禁，請與管理員聯繫',
	'logged_in' => '用户已登錄，請先退出登陸再註冊',
	'user_not_exists' => '用户不存在，請檢查用户名輸入',
	
	'no_login' => '用户未登陸，請從首頁登錄後再試',
	'login_check' => '用户信息驗證失敗，請清空緩存後再試',
	'login_time' => '登錄間隔時間過長，請重新登錄後再試',
	'login_info' => '用户信息不正確，請清空緩存和Cookie後進入遊戲',
	'player_limit' => '本局遊戲參加人數已達上限，無法進入，請下局再來',
	'wrong_pw' => '用户名或密碼錯誤，請檢查輸入',
	'player_exist' => '角色已經存在，請不要重複激活',
	'no_start' => '遊戲尚未開始，請稍後再試',
	'valid_stop' => '本遊戲已經停止激活，無法進入，請下局再來',
	'user_ban' => '此賬號禁止進入遊戲，請與管理員聯繫',
	'no_admin' => '你不是管理員，不能使用此功能',
	'ip_limit' => '本局此IP激活人數已滿，請下局再來',
	'no_power' => '你的管理權限不夠，不能進行此操作',
	'wrong_adcmd' => '指令錯誤，請重新輸入',
	//'invalid_name' => '用户名含有非法字符，请重新输入',
	//'banned_name' => '用户名含有违禁用语，请更改用户名',
	//'banned_ip' => '此IP已被封禁，请与管理员联系',
	//'long_name' => '用户名过长，请重新输入用户名'

	'alreay_in_room' => '你已經在房間裏了。要創建/加入房間必須退出當前房間。',
	'not_in_room' => '你不在任何房間裏。',
	'room_ip_limit' => '相同IP最多隻能創建2個房間。請先解散其他房間。',
	'room_num_limit' => '房間數量已達上限，無法新建房間。',
	'room_close_limit' => '你沒有權限解散該房間，只有房主或管理員可以解散房間。',
	'room_close_limit2' => '不能解散正在進行遊戲，且遊戲內尚有幸存者的房間！',
	'ruleset_no_permission' => '沒有權限創建該時光重現房間',
	'insufficient_credits' => '切糕餘額不足，無法創建時光重現房間',
	'invalid_ruleset' => '無效的時光重現版本',
);

?>
