<?php 

if(!defined('IN_GAME')) exit('Access Denied'); 
  
  $titles_list = Array 
  (
    0 => '參展者',
    1 => '幻想',
    2 => '流星',
    3 => '黑客',
    4 => '最後一步',
    5 => '越紅者',
    6 => '跨過彩虹',
    7 => '樹形圖',
    8 => 'TERRA',
    9 => '素描本',
    10 => '未來戰士',
    11 => '尋星者',
    12 => '寂靜洪流',
    13 => 'l33t',
    14 => '賭玉狂魔',
    15 => '時代眼淚',
    16 => '卸腿者',
    17 => '吉祥物',
    18 => '替天行道',
    19 => '美食家',
    20 => '補給掠奪者',
    21 => '神農',
    22 => '貝爺',
    23 => '熱血機師',
    24 => '毆系愛好者',
    25 => '蒼藍之光',
    26 => '斬系愛好者',
    27 => '合二為一',
    28 => '鑰刃大師',
    29 => '勇闖仙境',
    30 => '射系愛好者',
    31 => '黑洞邊緣',
    32 => '重槍愛好者',
    33 => '光的道路',
    34 => '決鬥者',
    35 => '加速同調',
    36 => '聚集的祈願',
    37 => '平和之心',
    38 => '投系愛好者',
    39 => '紅燒天堂',
    40 => '爆系愛好者',
    41 => '★刷刷刷★',
    42 => '★啪啪啪★',
    43 => '皇家烈焰',
    44 => '靈系愛好者',
    45 => '五行大師',
    46 => '賢者之石',
    47 => '知地利',
    48 => '知人和',
    49 => '混沌愛好者',
    50 => '混沌的深淵',
    51 => '棍棒愛好者',
    52 => '無情打釘者',
    53 => '磨刀愛好者',
    54 => '無情磨刀者',
    55 => '補丁愛好者',
    56 => '無情補丁',
    57 => '都市傳説',
    58 => '除錯大師',
    59 => '風馳電掣',
    60 => '暴雷驟雨',
    61 => '生存者',
    62 => '生存大師',
    63 => '實用主義者',
    64 => '現實主義者',
    65 => '腳底抹油',
    66 => '葉子欽定！',
    67 => '最後的榮光',
    68 => '執念的焰火',
    69 => '奇蹟的篝火',
    70 => '開路的明火',
    71 => '挑戰者',
    72 => '超越自我',
    73 => '超越人類',
    74 => '元素大師',
    75 => '二度打',
    76 => 'G.D.M',
    77 => '黃雀在此',
    78 => '貓咪在這！',
    79 => '大俠無名',
    80 => '極輕很輕',
    81 => '下毒黨的希望',
    82 => '下毒黨的榮光',
    83 => '下雷黨的希望',
    84 => '下雷黨的榮光',
    85 => '刪除！',
    86 => '風紀委員',
    87 => '風捲的象徵',
    88 => '勤奮好學',
    89 => '提高水平',
    90 => '復仇者',
    91 => '裁決者',
    92 => '城堡',
    93 => '海豹殺手',
    94 => '上帝之鞭',
    95 => '鍵·四季讚歌',
    96 => '★一發逆轉！★',
    97 => '『ＥＸ』',
    98 => '劍聖',
    99 => 'R.T.S',
    100 => '✦約定的鐵胃✦',
    101 => '✦空真理✦',
    102 => '✦光坂最強✦',
    103 => '✦ＬＢ的羈絆✦',
    104 => '✦莫非無敵✦',
    105 => 'KEY男',
    106 => '哲學家',
    107 => '鐵頭',
    108 => '神觸',
    109 => '銀之鍵',
    110 => '前向星',
    111 => '百變魔法使',
    112 => '換裝迷宮',
    113 => '四面骰',
    114 => '大隻佬',
    115 => '草木飛花',
    116 => '手下留情',
    117 => 'LOOP',
    118 => '虛擬體',
    119 => 'Daemon',
    120 => '弱子',

    # 第一期社区意见征询活动纪念称号：
    6001 => 'Lv.1 檸檬水',
    6002 => 'Lv.2 檸檬水',

    # 长期BUG提交奖励：软件测试工程师Lv.1~Lv.6
    7771 => 'Lv.1 昆蟲學者',
    7772 => 'Lv.2 昆蟲專家',
    7773 => 'Lv.3 鳥類學者',
    7774 => 'Lv.4 鳥類專家',
    7775 => 'Lv.5 語言學者',
    7776 => 'Lv.6 語言學家',
  );

  // rare: 0 - tgrey; 1 - tlime; 2 - tclan; 3 - tmagenta; 4 - torange; 5 - minirainbow;

  $title_desc = Array
  (
    # class-样式 title-提示悬浮框 img-图片url，会覆盖样式与悬浮框 

    # 0. 参展者
    0 => Array('class' => 'tgrey', 'title'=>" “參展者就是參加會展的人。你還記得自己是來參加動漫展的吧？”
      - 入場獎勵：獲得參加會展用的揹包，替代校服
      - 獲取方式：開局自帶
    "),
    # 1. 幻想
    1 => Array('class' => 'tlime', 'title'=>" “……”
      - 入場獎勵：暫無
      - 獲取方式：完成成就「永恆世界的住人」的階段二「幻想世界的往人」
    "),
    # 2. 流星
    2 => Array('class' => 'tclan', 'title'=>" “……”
      - 入場獎勵：暫無
      - 獲取方式：完成成就「永恆世界的住人」的階段三「永恆的覆唱」
    "),
    # 5. 越红者
    5 => Array('class' => "tlime", 'title'=>" “……”
      - 入場獎勵：獲得一把紅殺訓練用的鐵劍
      - 獲取方式：完成成就「冒煙突火」的階段二「紅殺將軍」
    "),
    # 6. 跨过彩虹
    6 => Array('class' => "tclan", 'title'=>" “……”
      - 入場獎勵：獲得一本奇怪的書，藍凝似乎很喜歡它
      - 獲取方式：完成成就「深度凍結」的階段二「跨過彩虹」
    "),
    # 8.TERRA
    8 => Array('class' => "tlime", 'title'=>" “……”
      - 入場獎勵：獲得篝醬曾經用過的奇妙武器
      - 獲取方式：完成成就「篝火的引導」的階段二「世界的樹形圖」
    "),
    # 11. 寻星者
    11 => Array('class' => "tmagenta", 'title'=>" “過去的尋星者，今日的領航星。”
      - 入場獎勵：獲得額外斬系熟練，裝備武器『尋星勇者』
      - 獲取方式：完成成就「尋星急襲」
    "),
    # 13. l33t
    13 => Array('class' => "tmagenta", 'title'=>"  “l33t是什麼意思？”
      - 入場獎勵：獲得KEY彈大禮包，可以通過合成來獲得真貨
      - 獲取方式：完成成就「233MAX」
    "),
    # 14. 赌玉狂魔
    14 => Array('class' => "tmagenta", 'title'=>" “馬有四條腿，少一條不打緊。”
      - 入場獎勵：犧牲了腿，獲得了更多金錢
      - 獲取方式：完成成就「真名解放」
    "),
    # 19. 美食家
    19 => Array('class' => 'tlime', 'title'=>" “雖然他吃的大部分都是糊糊。”
      - 入場獎勵：開局攜帶更好的補給……應該是這樣吧？
      - 獲取方式：完成成就「及時補給」的階段二「衣食無憂」
    "),
    # 20. 补给掠夺者
    20 => Array('class' => 'tclan', 'title' => " “糊糊不能吃嗎？”
      - 入場獎勵：暫無
      - 獲取方式：完成成就「及時補給」的階段三「奧義很爽」
    "),
    # 24. 殴系爱好者
    24 => Array('class' => 'tlime', 'title'=>" “毆繫到底有什麼武器用？冰棍棒嗎？”
      - 入場獎勵：獲得額外的毆系熟練度，並自帶稱號卡
      - 獲取方式：暫無
    "),
    # 26. 斩系爱好者
    26 => Array('class' => 'tlime', 'title'=>" “斬系愛好者已經瀕臨滅絕。”
      - 入場獎勵：獲得額外的斬系熟練度，並自帶稱號卡
      - 獲取方式：暫無
    "),
    # 38. 投系爱好者
    38 => Array('class' => 'tlime', 'title'=>" “小黃有點弱了，削下紅蓮龍吧！”
      - 入場獎勵：獲得額外的投系熟練度，並自帶稱號卡
      - 獲取方式：暫無
    "),
    # 40. 爆系爱好者
    40 => Array('class' => 'tlime', 'title'=>" “體力恢復	桔黃色的果醬 150/249”
      - 入場獎勵：獲得額外的爆系熟練度，並自帶稱號卡
      - 獲取方式：暫無
    "),
    # 30. 射系爱好者
    30 => Array('class' => 'tlime', 'title'=>" “「掠奪」使紅暮獲得了997元！”
      - 入場獎勵：獲得額外的射系熟練度，並自帶稱號卡
      - 獲取方式：暫無
    "),
    # 44. 灵系爱好者
    44 => Array('class' => 'tlime', 'title'=>" “其實他沒有超能力。”
      - 入場獎勵：獲得額外的靈系熟練度，並自帶稱號卡
      - 獲取方式：暫無
    "),
    # 57. 都市传说
    57 => Array('class' => 'tlime', 'title'=>" “所以説，種火究竟是啥？”
      - 入場獎勵：入場獲得本應該從奇怪種火盒子中開出的開門大吉福袋
      - 獲取方式：清除一些種火
    "),
    # 58. 除错大师
    58 => Array('class' => 'tlime', 'title'=>" “我知道了——種火是————！”
      - 入場獎勵：入場獲得「楓火歌者」稱號卡
      - 獲取方式：清除非常多的種火
    "),
    # 63. 实用主义者
    63 => Array('class' => "tlime", 'title'=>" “潤！”
      - 入場獎勵：獲得額外的全系熟練度，並自帶能開出防具等物品的福袋
      - 獲取方式：完成成就「逃避可恥？」的階段一
    "),
    # 64. 现实主义者
    64 => Array('class' => "tlime", 'title'=>" “猴！”
      - 入場獎勵：獲得額外的全系熟練度，並自帶能讓你轉危為安的技能書。
      - 獲取方式：完成成就「逃避可恥？」的階段二
    "),
    # 66. 叶子钦定！
    66 => Array('class' => "tlime", 'title'=>" “小葉子認為你做得對！”
      - 入場獎勵：獲得「核子補給」
      - 獲取方式：完成成就「核爆全滅」的階段二「麻煩製造機？」
    "),
    # 69. 奇迹的篝火
    69 => Array('class' => "tclan", 'title'=>" “這是我們的使命。”
      - 入場獎勵：可以看見遊戲中大部分骰子的結果
      - 獲取方式：完成成就「幻境解離」的階段一
    "),
    # 114. 大只佬
    114 => Array('class' => "tclan", 'title'=>" “無論怎麼看，這都是一名標準的受王強者。”
      - 入場獎勵：佩戴一個「★閃耀護符★」入場，但它有什麼用呢？
      - 獲取方式：承受一次一百萬以上的傷害。
    "),
    
    # 120. 弱子
    120 => Array('img'=>"img/nicktest.png",),

    # 6001~6002 第一期意见征询活动纪念头衔
    6001 => Array('class' => 'tlime', 'title' => " “這個遊戲以前其實有過留言板系統。”
      - 入場獎勵：暫無
      - 獲取方式：在官方討論區參與了第一期意見徵詢活動"),
    6002 => Array('class' => 'tlime', 'title' => " “後來它變成了小廣告系統。”
      - 入場獎勵：暫無
      - 獲取方式：在官方討論區參與了第一期意見徵詢活動，並提供了被採納的建議"),

    # 7771~7776 软件测试工程师Lv.1~Lv.6
    7771 => Array('class' => 'tlime', 'title' => " “他很擅長鑑定網絡熱門昆蟲。” 
      - 入場獎勵：暫無
      - 獲取方式：幫助開發團隊捉住了 1 只 bug"),
    7772 => Array('class' => 'tclan', 'title' => " “他已經不再滿足於只鑑定昆蟲了。”
      - 入場獎勵：暫無
      - 獲取方式：幫助開發團隊捉住了 5 只 bug"),
    7773 => Array('class' => 'tlime', 'title' => " “鴿子湯就是用鴿子做的湯，要做鴿子湯，首先要將生薑切成……”
      - 入場獎勵：暫無
      - 獲取方式：幫助開發團隊捉住了 10 只 bug"),
    7774 => Array('class' => 'tclan', 'title' => " “我是小八哥、我是你……”
      - 入場獎勵：暫無
      - 獲取方式：幫助開發團隊捉住了 15 只 bug"),
    7775 => Array('class' => 'tmagenta', 'title' => " “文字，是句讀的韻律，是魔法的咒語。”
      - 入場獎勵：暫無
      - 獲取方式：幫助開發團隊捉住了 30 只 bug"),
    7776 => Array('class' => 'tmagenta', 'title' => " “文字，使愚者千慮，供智者隱喻。”
      - 入場獎勵：暫無
      - 獲取方式：幫助開發團隊捉住了 50 只 bug"),
  );

  //所有在player表里登记过的合法字段都可以写进里面 //非法内容会被自动过滤掉……大概吧
  //同时，也支持合法的运算符，写在 [::] 内可以自动识别…… //呃试着做了下感觉有风险，还是写死吧，暂时只支持 += -= *= /= 四种吧，应该够用了吧？
  //比如入场时斩熟+50 就写 'wk' => '[:+=:]50',
  $title_valid = Array
  (
    # 120. 弱子
    120 => Array(
      'clbpara' => Array('cheater' => 1,),
    ),
    # 0. 参展者
    0 => Array(
      'arb' => '二次元漫展揹包', 'arbk' => 'DB', 'arbe' => 5,  'arbs' => 5, 'arbsk' => '^',
    ),
    # 66. 叶子钦定！
    66 => Array(
      'itm5' => '核子麪包', 'itmk5' => 'HH', 'itme5' => 237,  'itms5' => 5, 'itmsk5' => '',
      'itm6' => '核子礦泉水', 'itmk6' => 'HS', 'itme6' => 237,  'itms6' => 5, 'itmsk6' => '',
    ),
    # 11. 寻星者
    11 => Array(
      'wk' => '[:+=:]50',
      'wep' => '『尋星勇者』', 'wepk' => 'WK', 'wepe' => 90,  'weps' => 35, 'wepsk' => 'd',
    ),
    # 8.TERRA
    8 => Array(
      'itm6' => '篝醬的奇蹟☆膠帶～棍', 'itmk6' => 'WP', 'itme6' => 42,  'itms6' => 300, 'itmsk6' => 'dej',
    ),
    # 5. 越红者
    5 => Array(
      'itm6' => '紅殺鐵劍', 'itmk6' => 'WK', 'itme6' => 60,  'itms6' => 30, 'itmsk6' => 'N',
    ),
    # 6. 跨过彩虹
    6 => Array(
      'itm6' => 'AZURE RONDO模樣的杏仁豆腐', 'itmk6' => 'WF', 'itme6' => 233,  'itms6' => 9, 'itmsk6' => 'd',
    ),
    # 13. l33t
    13 => Array(
      'itm1' => '鍵 希望彈模樣的杏仁豆腐', 'itmk1' => 'WC', 'itme1' => 500,  'itms1' => 1, 'itmsk1' => 'z',
      'itm2' => '鍵 燃燒彈模樣的杏仁豆腐', 'itmk2' => 'WF', 'itme2' => 500,  'itms2' => 1, 'itmsk2' => 'z',
      'itm3' => '鍵 生命彈模樣的杏仁豆腐', 'itmk3' => 'WG', 'itme3' => 500,  'itms3' => 1, 'itmsk3' => 'z',
      'itm4' => '鍵 未來彈模樣的杏仁豆腐', 'itmk4' => 'WP', 'itme4' => 500,  'itms4' => 1, 'itmsk4' => 'z',
      'itm5' => '鍵 催淚彈模樣的杏仁豆腐', 'itmk5' => 'WD', 'itme5' => 500,  'itms5' => 1, 'itmsk5' => 'z',
      'itm6' => '鍵 旅途彈模樣的杏仁豆腐', 'itmk6' => 'WK', 'itme6' => 500,  'itms6' => 1, 'itmsk6' => 'z',
    ),
    # 14. 赌玉狂魔
    14 => Array(
      'money' => '[:+=:]3210',
      'wep' => '增殖之腿', 'wepk' => 'WCP', 'wepe' => 10,  'weps' => '∞', 'wepsk' => 'd',
      'arf' => '腿？', 'arfk' => 'DF', 'arfe' => 9, 'arfs' => 19, 'arfsk' => 'VxK',
    ),
    # 19. 美食家
    19 => Array(
      'itm1' => '裱花布里歐修', 'itmk1' => 'HH', 'itme1' => 255,  'itms1' => 10, 'itmsk1' => 'z',
      'itm2' => '埃斯卡依雲斐濟水', 'itmk2' => 'HS', 'itme2' => 255,  'itms2' => 20, 'itmsk2' => 'z',
      'itm6' => '強效西柚汁', 'itmk6' => 'HB', 'itme6' => 127,  'itms6' => 15, 'itmsk6' => 'z',
    ),
    # 24. 殴系爱好者
    24 => Array(
      'wp' => '[:+=:]50',
      'itm6' => '「街頭霸王」稱號卡', 'itmk6' => 'ZB', 'itme6' => 1,  'itms6' => 1, 'itmsk6' => '',
    ),
    # 26. 斩系爱好者
    26 => Array(
      'wk' => '[:+=:]50',
      'itm6' => '「見敵必斬」稱號卡', 'itmk6' => 'ZB', 'itme6' => 2,  'itms6' => 1, 'itmsk6' => '',
    ),
    # 38. 投系爱好者
    38 => Array(
      'wc' => '[:+=:]50',
      'itm6' => '「灌籃高手」稱號卡', 'itmk6' => 'ZB', 'itme6' => 3,  'itms6' => 1, 'itmsk6' => '',
    ),
    # 40. 爆系爱好者
    40 => Array(
      'wd' => '[:+=:]50',
      'itm6' => '「拆彈專家」稱號卡', 'itmk6' => 'ZB', 'itme6' => 5,  'itms6' => 1, 'itmsk6' => '',
    ),
    # 30. 射系爱好者
    30 => Array(
      'wg' => '[:+=:]50',
      'itm6' => '「狙擊鷹眼」稱號卡', 'itmk6' => 'ZB', 'itme6' => 4,  'itms6' => 1, 'itmsk6' => '',
    ),
    # 44. 灵系爱好者
    44 => Array(
      'wf' => '[:+=:]50',
      'itm6' => '「超能力者」稱號卡', 'itmk6' => 'ZB', 'itme6' => 9,  'itms6' => 1, 'itmsk6' => '',
    ),
    # 57. 都市传说
    57 => Array(
      'itm6' => 'GRAND OPENING 「開門大吉」', 'itmk6' => 'p000', 'itme6' => 1,  'itms6' => 1, 'itmsk6' => '',
    ),
    # 63. 实用主义者
    63 => Array(
      'wp' => '[:+=:]25','wk' => '[:+=:]25','wc' => '[:+=:]25','wd' => '[:+=:]25','wg' => '[:+=:]25','wf' => '[:+=:]25',
      'itm6' => 'SPECIAL TECH 「特選科技」', 'itmk6' => 'p0O1', 'itme6' => 1,  'itms6' => 1, 'itmsk6' => '',
    ),
    # 64. 现实主义者
    64 => Array(
      'wp' => '[:+=:]50','wk' => '[:+=:]50','wc' => '[:+=:]50','wd' => '[:+=:]50','wg' => '[:+=:]50','wf' => '[:+=:]50',
      'itm6' => '現實逃避論～一轉攻勢之卷', 'itmk6' => 'VS', 'itme6' => 1,  'itms6' => 1, 'itmsk6' => 'tl_oncemore',
      'itm5' => '現實逃避論～風中殘燭之卷', 'itmk5' => 'VS', 'itme5' => 1,  'itms5' => 1, 'itmsk5' => 'tl_2ndchance',
    ),
    # 114. 大只佬
    114 => Array(
      'art' => '★閃耀護符★', 'artk' => 'A', 'arte' => 1, 'arts' => 1, 'artsk' => 'xv',
    ),
    # 58. 除错大师
    58 => Array(
      'itm6' => '「ПΑЫЙΨ」的記事本', 'itmk6' => 'ZB', 'itme6' => 22,  'itms6' => 1, 'itmsk6' => '',
    ),
  );

?>