<?php
if(!defined('IN_GAME')) exit('Access Denied');

$posetips = Array(
	0 => "最普通的姿態",
	1 => "以備戰為目的，略微提升角色發現率。極大幅提升攻擊力、防禦力",
	2 => "以追獵敵人為目的，大幅提升角色先制率",
	3 => "以尋找物品為目的，提升道具發現率。中幅降低攻擊力、防禦力",
	4 => "以先發制人為目的，提升角色發現率以及先手率。中幅提升攻擊力，但是會大幅降低防禦力",
	5 => "以自我治療為目的，提升恢復能力。但其他數值大幅惡化",
	6 => "以快速發現敵人為目的，極大幅提升角色遇敵率，略微提升先制率，極大幅降低防禦力",
	7 => "以哨戒為目的，初次受到攻擊時不會反擊。但在受到攻擊後會變換作戰姿態",
	8 => "切換戰術界面的感知模式，只會遭遇同處於✧靈子姿態✧的對象，同時不會被處於其他姿態的對象發現。\r脱離靈子姿態後，需要等待1分鐘後才可重新進入。",
);
$tactips = Array(
	0 => "沒有策略就是你的策略",
	1 => "",
	2 => "隨時準備防禦敵方攻擊和陷阱的策略。會大幅提升防禦力",
	3 => "隨時準備反擊敵人攻擊的策略。會提升先制率、攻擊力，但中幅降低防禦力",
	4 => "試圖迴避敵人、陷阱和禁區的策略。中幅降低攻擊力、防禦力",
);

$tps_names = Array
(
	# 用于记录一些内容重复但来源不同的描述
	# 不能改善性能，但是可以保护视力与腱鞘？……大概吧
	#0:巫师物品
	0 => Array('class'=>'spitem2', 'title'=>"為遊戲做出過貢獻的巫師的裝備。",),
	#1:福袋SR
	1 => Array('class'=>'neonorange', 'title'=>"從幸運禮物福袋中以二成幾率左右能開出的強力裝備。",),
	#2:福袋SSR
	2 => Array('class'=>'rainbow', 'title'=>"從幸運禮物福袋中以極低幾率左右能開出的強力裝備。",),
	#3:钉
	3 => Array('title'=>"為手中名字帶有“棍棒”的鈍器打釘子，以增加效果值"),
	#4:磨刀石
	4 => Array('title'=>"讓手中鋭器更加鋒利，以增加效果值"),
	#5:针线包
	5 => Array('title'=>"增加裝備着的身體防具的效果值"),
	#99: ???
	99 => Array('title'=>"……這、這是什麼？！"),
);

$tps_name = Array
(
	# 强化道具
	'釘' => 3, '鋼釘' => 3, '艾蓮娜的聖釘' => 3, '埃克法-冰凌-釘' => 3,
	'磨刀石' => 4, '黑磨刀石' => 4, '沉默磨刀石' => 4, '賢者之磨刀石' => 4, '埃克法-融煉-磨刀石' => 4,
	'針線包' => 5,
	# 特殊道具
	'武器師安雅的獎賞' => Array('title'=>"強化手中武器的效果值、耐久值，或者將類型轉變為你更擅長的系別"),
	'凸眼魚' => Array('title'=>"使用後可以銷燬整個戰場現有的屍體"),
	'魚眼凸' => Array('title'=>"使用後可以將整個戰場的屍體吸到你的位置，但後果自負！"),
	'小葉子的妙妙箱' => Array('title'=>"可以從這個箱子中翻出各種各樣能作為陷阱的東西，但不要太貪心，否則後果自負！"),
	'杏仁豆腐的ID卡' => Array('title'=>"連鬥後使用可以讓全場NPC消失並進入『死鬥階段』"),
	'水果刀' => Array('title'=>"可以切水果。如果不會用可能會切到自己"),
	'探測器電池' => Array('title'=>"使用後可以為探測儀器供電"),
	'★閃耀護符★' => Array('class'=>'minirainbow', 'title'=>"擁有它之後，據説觸發某個特定事件的概率會大幅度上升。"),
	'【歌單】紅暮' => Array('class'=>'ltcrimson', 'title'=>"保存着勁爆搖滾樂的音樂播放器，讓你能聯想到紅暮的強大。"),
	'【歌單】藍凝' => Array('class'=>'ltazure', 'title'=>"保存着八九十年代風格迷幻流行人聲音樂的音樂播放器，讓你能聯想到藍凝的可愛。"),
	'【歌單】芙蓉' => Array('class'=>'tmagenta', 'title'=>"保存着李斯特作品的音樂播放器，讓你能聯想到芙蓉的忠心。"),
	'【歌單】丁香' => Array('class'=>'clan', 'title'=>"保存着明快的純音樂的音樂播放器，讓你能聯想到丁香的温柔。"),
	'【歌單】冰炎' => Array('class'=>'orange', 'title'=>"保存着風格似乎來源自某著名動作遊戲系列BGM的音樂播放器，讓你能聯想到冰炎的努力。"),
	'【歌單】小兔子警報！' => Array('class'=>'lime', 'title'=>"保存着可愛的兒歌的……什麼東西。"),
	'【歌單】瑞克·拉瑪爾' => Array('class'=>'minirainbow', 'title'=>"保存着勁爆飆車BGM的音樂播放器，讓你可以以隨機數培養自己。警告：一旦使用無法恢復！"),
	'人生重來炮' => Array('title'=>"一個可以部署的馬戲團大炮，可以將你自己發射出去，讓你煥然一新！"),
	'善良之刃' => Array('title'=>"一把有着羽毛裝飾的匕首，可以消耗200點怒氣，嘗試自裁。"),
	# 怪东西
	'■DeathNote■' => 99, '奇怪的按鈕' => 99, '『S.C.R.A.P』' => 99,
	# 电掣装置
	'魔法蜂針' => Array('class'=>'spitem', 'title'=>"這個武器一定會對敵人造成350點傷害，但對防禦非常高的敵人除外。",),
	'臨摹裝置' => Array('class'=>'spitem', 'title'=>"這個武器在主動攻擊對手時，將可以複製對手的武器。注意：對手武器數值太高時會失敗，後果自負！",),
	# 巫师物品
	'■膠凍の巴雷特■' => 0,'■膠凍的風衣■' => 0,'■膠凍的兜帽■' => 0,'■膠凍的跑鞋■' => 0,'■膠凍的手套■' => 0,'■膠凍的吊墜■' => 0,
	'■便攜式火力平台■' => 0,'■Type3防彈插板■' => 0,'■VFL 6-24×56光學瞄具■' => 0,'■IOP T4外骨骼■' => 0,'■熱光學迷彩披風■' => 0,'■遺留的武器庫■' => 0,
	'【工作用數位板】' => 0,'【學園針織罩衫】' => 0,'【魚形髮卡】' => 0,'【學園制服鞋】' => 0,'【工作用數位筆】' => 0,'【布藝貓咪掛件】' => 0,
	# 福袋SR
	'「信仰之山」' => 1,'「間斷的噩夢」' => 1,'「運鈍根的捕物帳」' => 1,'「喧囂敍事曲」' => 1,'「昇天」' => 1,
	'「曳光」' => 1,'「人生重來箱」' => 1,'「菁英宅之怒」' => 1,'閉鎖世界的冥神 Ｌ5' => 1,'鐵獸式強襲機動兵裝改牛頭伯勞2 Ｌ5' => 1,
	'防火龍·暗流體 Ｌ5' => 1,'前託槍管龍 Ｌ5' => 1,'電子界到臨者＠火靈天星 Ｌ6' => 1,'召命之神弓-阿波羅薩 Ｌ4' => 1,'「活躍迎春曲」' => 1,'「飄落」' => 1,'「明動」' => 1,
	'「正午高陽」' => 1,'神滅兵器－天霆號扼宙斯 ☆12' => 1,'「碧海船歌」' => 1,'「翼展」' => 1,'「安謐」' => 1,
	'「午前許願」' => 1,'神之聖劍' => 1,'「金霜協奏曲」'=>1,'「龍怒」' => 1,'「昇天」' => 1,'「寧靜」' => 1,'「清晨恩典」' => 1,'神之棍棒' => 1,
	# 福袋SSR
	'隨機數之神的棍棒' => 2,'隨機數之神的聖劍' => 2,'隨機數之神的淚水' => 2,
	'隨機數之神的神力' => 2,'隨機數之神的震撼' => 2,'隨機數之神的攝理' => 2,'隨機數之神的惡戲' => 2,
	# 福袋惩罚物品
	'烏黑的臉' => Array('title'=>"貪 心 不 足 蛇 吞 象"),
	# 一个特判 - 这游戏中不会出现叫做【神秘条件】的物品吧……
	'神秘條件' => Array('class'=>'lime', 'title'=>"要合成該物品需要滿足一個特定的神秘條件。"),
	# OTHERS
	'😂我太酷啦！😂' =>Array('class'=>'rainbow', 'title'=>"一個笑哭黃豆模樣的按鈕，按下後立刻將自己炸成一朵煙花（自身死亡）。"),
	'【我太帥啦！】' =>Array('title'=>"這是一個整蠱自己的按鈕。將會把你的揹包替換成一堆無用的遊戲王卡片。"),
	'【我太棒啦！】' =>Array('title'=>"這是一個整蠱自己的按鈕。將會削掉你的生命和體力，並將它們轉化為等效補給。"),
	'【我太強啦！】' =>Array('title'=>"這是一個整蠱自己的按鈕。你會向眾人宣言你很強，然後為了證明你的實力，你的最大生命值將會下降100點。"),
	'【我太牛啦！】' =>Array('title'=>"這是一個整蠱自己的按鈕。將會向眾人宣言你很牛，然後為了證明這一點，你會將你的最大生命值和最大體力值變成金錢。"),
	'「我頭四」' =>Array('title'=>"使用四種不同的整蠱道具合成的強力彩虹陷阱，踩到的玩家將受到300點固定傷害並變得遍體鱗傷。但如果滿足某個條件的話……"),
	'破則戰術「我頭四」' =>Array('class'=>'minirainbow', 'title'=>"滿足某個特定條件後，合成的「我頭四」便可以一擊必殺。"),
	'神秘的「🥚」' =>Array('class'=>'glitch1', 'title'=>"一個神秘的蛋狀物品，你潛意識覺得它可能會很大條，而且覺得它像是什麼哺乳生物產生的……"),
	'✦ЦВЙΨХЩΗЖФ✦' =>Array('class'=>'spitem2', 'title'=>"看起來是一個黑色的，安靜的盒子，裏面可能放着好東西。可以加上一個焰火進一步合成。"),
	'✦ЦΨЙЩЦΑПΨЁВЦЩΨ✦' =>Array('class'=>'spitem2', 'title'=>"看起來是一個橙色的，騷動的盒子，裏面可能放着莫名其妙的東西。以及對臉系玩法有用的東西"),
	'✦【自律AI呼喚器】' =>Array('title'=>"這是一個整蠱他人的NPC鑰匙。會向遊戲內部署大量特殊小兵NPC，你會因此遭到道德拷問。"),
	# HOROU用
	'悠久「銘刻時間的古代之風」' =>Array('class'=>'orange'),
	'光翼「羽翼地帶」' =>Array('class'=>'red'),
	'幻想「世界遺產·佐渡金銀彈」' =>Array('class'=>'darkviolet'),
	'超妖精「深藍兒童」' =>Array('class'=>'blue'),
	'寶具「鍊金銀劍超級時鐮」' =>Array('class'=>'darkcyan'),
	'禁忌「生命鍊金 - Hollow Friends」' =>Array('class'=>'seagreen'),
	'橙符「沙漠色的熱風」' =>Array('class'=>'orange'),
	'赤符「紅色箭羽選中你了！」' =>Array('class'=>'red'),
	'紫符「佐渡的紫水晶彈」' =>Array('class'=>'darkviolet'),
	'藍符「木乃伊妖精」' =>Array('class'=>'blue'),
	'青符「鍊金水劍最後終結」' =>Array('class'=>'darkcyan'),
	'綠符「呼喚同伴的綠色石板」' =>Array('class'=>'seagreen'),

);

$tps_name_lore = Array
(
	# 来自mtkkk的怪主意
	'😂我太酷啦！😂' =>Array('class'=>'minirainbow', 'title'=>"「林董事長不在了，空降的女兒又不管事，摸了摸了……」——林氏軟件員工"),
	# LORE，看了这些内容，还不考虑拆分这个文件么？总之先搞这么多……
	'燃素加農炮『爆炎』MK-II' => Array('title'=>"在接受好友的委託之時，一切看起來都只像一個簡單的工作。"),
	'奧術盔甲B - 炎' => Array('title'=>"但正如自己的爺爺所説過的那樣，看起來簡單的東西，往往背後有坑。"),
	'奧術盔甲H - 炎' => Array('title'=>"紅暮並不怕什麼坑，畢竟坑就是為了踩而出現的，你不踩下去，都可以説是不尊重挖坑的人。"),
	'奧術盔甲A - 炎' => Array('title'=>"在意的事情雖然有很多，但紅暮覺得將它們拋在腦後可能更好一點。"),
	'奧術盔甲F - 炎' => Array('title'=>"既然接受了挑戰，自己就沒有不全力以赴的理由。"),
	'冰炎盔甲B' => Array('title'=>"那命運之日的夕陽，緩慢給一切鍍上明亮的橙光。"),
	'冰炎盔甲H' => Array('title'=>"那約定之時的榮耀，為四位被影響的人們裹上金黃的光輝。"),
	'冰炎盔甲A' => Array('title'=>"那幻境之中的風景，以平等的紫光照耀着一切。"),
	'冰炎盔甲F' => Array('title'=>"那為了友人的決意，形成了靛藍的意志。"),
	'『AZURE RONDO · AQUAMARINE』' => Array('title'=>"那和自己一樣的影子，最終遁入了那一抹豔紅。"),
	'噴氣式紅殺重鐵劍' => Array('title'=>"「將最基礎的武器魔改成了這樣了麼？真是讓人大開眼界。」——芙蓉"),
	'緋紅記憶' => Array('title'=>"「先問一句，雖然你似乎吹得很神奇，但這玩意並不是什麼超能力吧？」——紅暮"),
	'血色強襲' => Array('title'=>"「海鳴姐就像超級英雄那樣！」——丁香"),
	'獅虎絲帶' => Array('title'=>"「有時候殺傷力最強的東西反而以最簡單的形式出現，這個我懂，但這東西是不是太張揚了……？」——亞瑪麗歐·維拉蒂安"),
	'落櫻巨錘' => Array('title'=>"「先説好了，揮舞着笨重的武器不代表我暗示你人笨重，信任動力裝甲的方面，你應該比我更清楚吧？」——冰炎"),
	'八八連流星浮游炮' => Array('title'=>"「真是鋪張浪費，浮游炮一發3個就足夠了。預算要花在刀刃上，省點錢讓我開限定手辦哈。」——藍凝"),
	'✧覆唱之歌' => Array('title'=>"「長大以後你想繼承父母的研究嗎？」8歲少女的父母如此問道。「那是當然！」8歲少女點頭回應。"),
	'✧無畏之愛' => Array('title'=>"「你喜歡什麼樣子的男生？」13歲少女的同齡閨蜜如此問道。「唔……沒想好，最好的夥伴吧……」13歲少女歪了歪頭，似乎自己也不滿意這個答案。"),
	'✧憐憫之痛' => Array('title'=>"「正在做的，是什麼樣的東西呢？」5歲少女對自己埋頭苦幹的父親如此問道。「這是一個會讓大家露出笑容的東西呢。」這就是這位5歲少女父親的説法。"),
	'✧執念之刺' => Array('title'=>"「為什麼要如此拼命呢？」10歲少女對自己好友如此問道。「不拼命的話，就無法保護將被奪走的事物了。」10歲少女的這位好友就這樣説出了耍酷的台詞。"),
	'✧希望之風' => Array('title'=>"「啊！成功了！」15歲少女歡呼雀躍，但環顧四周，似乎並沒有——「恭喜恭喜！」在門外等着的2位15歲少女的好友就在這個時機破門而入！"),
	'◆火之碎片' => Array('title'=>"「在這場交易中，我最終勝你半子。」31歲女強人的意識，於隨後遁入虛空。"),
	# 更多的怪文书
	'神秘的「🥚」' =>Array('class'=>'glitchb', 'title'=>"「你就放它一百個心，既然你這麼信任我，我就沒有做不出來的道理。」——克里斯汀"),
	'✦ЦВЙΨХЩΗЖФ✦' =>Array('class'=>'spitem2', 'title'=>"「知道麼？萬事都要做好萬全的準備，或者説，你要讓你的敵人覺得你做好了完全的準備。」——林無月"),
	'✦ЦΨЙЩЦΑПΨЁВЦЩΨ✦' =>Array('class'=>'spitem2', 'title'=>"「你聽到……呼喚了嗎？」——？？？"),
);

$tps_ik = Array
(
	'Ag' => Array('title' =>"可能帶有同志屬性",),
	'Al' => Array('title' =>"可能帶有熱戀屬性",),
	'Ah' => Array('title' =>"可能帶有？？？屬性",),
	'Ac' => Array('title' =>"可能帶有重擊輔助屬性",),
	'B'  => Array('title' =>"使用後可以為電腦設備供電",),
	'C'  => Array('title' =>"使用後可以解除異常狀態",),
	'Ce' => Array('title' =>"使用後可以解除麻痹狀態",),
	'Ci' => Array('title' =>"使用後可以解除凍結狀態",),
	'Cp' => Array('title' =>"使用後可以解除中毒狀態",),
	'Cu' => Array('title' =>"使用後可以解除燒傷狀態",),
	'Cw' => Array('title' =>"使用後可以解除混亂狀態",),
	'EE' => Array('title' =>"使用後有一定概率能夠解封當前禁區，需要電池充電",),
	'EW' => Array('title' =>"使用後可改變當前天氣，對極端天氣無效",),
	'ER' => Array('title' =>"使用後可激活雷達界面",),
	'HH' => Array('title' =>"使用後恢復等於道具效果值的生命",),
	'HS' => Array('title' =>"使用後恢復等於道具效果值的體力",),
	'HB' => Array('title' =>"使用後恢復等於道具效果值的生命和體力",),
	'HM' => Array('title' =>"使用後增加等於道具效果值的歌魂上限",),
	'HT' => Array('title' =>"使用後恢復等於道具效果值的歌魂",),
	'HR' => Array('title' =>"使用後增加等於道具效果值的怒氣",),
	'PM' => Array('title' =>"使用後曾加等於道具效果值的歌魂上限",),
	'PT' => Array('title' =>"使用後灰復等於道具效果值的歌魂",),
	'PR' => Array('title' =>"使用後曾加等於道具效果值的怒氣",),
	'PH' => Array('title' =>"使用後灰復等於道具效果值的生命",),
	'PS' => Array('title' =>"使用後灰復等於道具效果值的體力",),
	'PB' => Array('title' =>"使用後灰復等於道具效果值的生命和體力",),
	'PB2' => Array('title' =>"使用後灰復等於道具效果值的生命和體力",),
	'GBr'=> Array('title' =>"為帶有“連擊”屬性，且不適用“能源、氣體彈藥”的槍械供彈",),
	'GBi'=> Array('title' =>"為帶有“火焰、凍氣”屬性，且不適用“能源彈藥”的槍械供彈",),
	'GBh'=> Array('title' =>"為“重型槍械”供彈",),
	'GBe'=> Array('title' =>"為帶有“電擊、音波”屬性的槍械供彈",),
	'GB' => Array('title' =>"為普通槍械供彈",),
	'V'  => Array('title' =>"使用後會根據道具效果值獲得一定的熟練度",),
	'M'  => Array('title' =>"使用後會根據道具效果值強化特定屬性",),
	'MA' => Array('title' =>"使用後會根據道具效果值強化攻擊力",),
	'MD' => Array('title' =>"使用後會根據道具效果值強化防禦力",),
	'ME' => Array('title' =>"使用後會根據道具效果值獲得一定的經驗值",),
	'MH' => Array('title' =>"使用後會根據道具效果值強化生命上限",),
	'MS' => Array('title' =>"使用後會根據道具效果值強化體力上限",),
	'T'  => Array('title' =>"使用後可以在當前地區埋設一枚陷阱",),
	'U'  => Array('title' =>"使用後將掃除當前地區內的一枚陷阱……但是這一切真的值得嗎？",),
	'WGK'=> Array('title' =>"兼具射擊與斬擊功效的武器",),
	'WCF'=> Array('title' =>"兼具投擲與靈力功效的武器",),
	'WCP'=> Array('title' =>"兼具投擲與打擊功效的武器",),
	'WKF'=> Array('title' =>"兼具斬擊與靈力功效的武器",),
	'WKP'=> Array('title' =>"兼具斬擊與打擊功效的武器",),
	'WFK'=> Array('title' =>"兼具靈力與斬擊功效的武器",),
	'WDG'=> Array('title' =>"兼具伏擊與射擊功效的武器",),
	'WDF'=> Array('title' =>"兼具伏擊與靈力功效的武器",),
	'AA' => Array('class'=>'spitem', 'title'=>"可以將一定數量的攻擊次數傷害變為0，那之後失效",),
	'AB' => Array('class'=>'spitem', 'title'=>"裝備後，對補給品使用毒藥下毒變為為其解毒。",),
	'XA' => Array('class'=>'lime', 'title'=>"集齊三個同顏色的不同名代碼殘片，來合成單人脱出結局道具吧！",),
	'XB' => Array('class'=>'purple', 'title'=>"集齊三個同顏色的不同名代碼殘片，來合成單人脱出結局道具吧！",),
	'XC' => Array('class'=>'yellow', 'title'=>"集齊三個同顏色的不同名代碼殘片，來合成單人脱出結局道具吧！",),
	'ZB' => Array('class'=>'lime', 'title'=>"在沒有決定稱號的時候使用該物品，便可獲得該對應稱號。",),
	'ZA' => Array('class'=>'neonyellow', 'title'=>"這個物品中似乎含有讓你可以獨自脱離幻境的方法……",),
	'🥚' => Array('class'=>'purple', 'title'=>"通過提取物品產生的蛋狀物品，看起來可以插回其他物品為之強化。",),
	'🎲' => Array('class'=>'spitem', 'title'=>"投擲出骰子，來獲得隨機效果。",),
	'🎆' => Array('class'=>'lime', 'title'=>"神秘存在身上掉落的碎片，似乎和你很匹配。",),
	'🎆H' => Array('class'=>'lime', 'title'=>"神秘存在身上掉落的碎片，似乎和你很匹配。",),
	'🎆V' => Array('class'=>'lime', 'title'=>"神秘存在身上掉落的碎片，似乎和你很匹配。",),
	'🎆O' => Array('class'=>'lime', 'title'=>"神秘存在身上掉落的碎片，似乎和你很匹配。",),
	'🎆D' => Array('class'=>'lime', 'title'=>"神秘存在身上掉落的碎片，似乎和你很匹配。",),
	'🎆B' => Array('class'=>'lime', 'title'=>"神秘存在身上掉落的碎片，你覺得它似乎能變成別的什麼東西。",),
	'🎆C' => Array('class'=>'lime', 'title'=>"鉮秘洊茬裑仩鋽落哋誶爿，沵覺嘚咜姒苸能變荿莂哋什庅崬覀。",),
	'P🎆' => Array('class'=>'lime', 'title'=>"神秘存在身上掉落的碎片，似乎和你狠匹配。",),
);

$tps_isk = Array
(
	'A' => Array('title' => "高概率將毆斬射投爆靈六系對你的傷害減半。",),//测试用
	'a' => Array('title' => "高概率將毒火凍電亂音以及爆炸對你的傷害減半。並避免異常狀態。",),//测试用
	'B' => Array('title' => "極高概率將全部物理傷害變為1。",),
	'b' => Array('title' => "極高概率將全部屬性傷害變為1。",),
	'C' => Array('title' => "高概率將投系對你的物理傷害減半。",),
	'c' => Array('title' => "攻擊時額外獲得1點怒氣，發動戰鬥技時會返還10%消耗的怒氣",),
	'D' => Array('title' => "高概率將爆系對你的物理傷害，以及爆炸屬性傷害減半。",),
	'd' => Array('title' => "攻擊對手時，將產生額外的爆炸屬性傷害。",),
	'E' => Array('title' => "高概率將電擊屬性對你的屬性傷害減半。並避免身體麻痹狀態。",),
	'e' => Array('title' => "攻擊對手時，將產生額外的電擊屬性傷害。也有可能讓對手陷入身體麻痹異常狀態。",),	
	'F' => Array('title' => "高概率將靈系對你的物理傷害減半。",),
	'f' => Array('title' => "攻擊對手時，對其造成無法防禦的火焰屬性傷害。也有可能讓對手陷入燒傷異常狀態。",),
	'G' => Array('title' => "高概率將射系（包括重型槍械）對你的物理傷害減半。",),
	'g' => Array('title' => "低概率在攻擊異性敵人時傷害加倍，但攻擊同性的物理傷害降為1。",),
	'H' => Array('title' => "將你受到的反噬傷害降低90%。",),
	'h' => Array('title' => "高概率將你受到的最高傷害壓制在兩千左右。",),
	'I' => Array('title' => "高概率將凍氣屬性對你的屬性傷害減半。並避免凍結狀態。",),
	'i' => Array('title' => "攻擊對手時，將產生額外的凍氣屬性傷害。也有可能讓對手陷入凍結異常狀態。",),
	'J' => Array('title' => "將卡片變成可以進行超量合成的素材。",),
	'j' => Array('title' => "使用「武器模式」命令可將該物品轉變為其他形態。",),
	'K' => Array('title' => "高概率將斬系對你的物理傷害減半。",),
	'k' => Array('title' => "攻擊對手時，對其造成無法防禦的凍氣屬性傷害。也有可能讓對手陷入凍結異常狀態",),
	'L' => Array('title' => "攻擊對手時，讓對手的冷卻時間大幅度增加。",),
	'l' => Array('title' => "低概率在攻擊同性敵人時傷害加倍，但攻擊異性的物理傷害降為1。",),
	'M' => Array('title' => "提高一定陷阱迴避率。",),
	'm' => Array('title' => "觸發陷阱時，中機率免疫其傷害。",),
	'N' => Array('title' => "攻擊對手時，中幾率將對手防具的防禦力修正為一半來計算傷害。",),
	'n' => Array('title' => "攻擊對手時，一定幾率無效抹消類與防禦類屬性。",),
	'o' => Array('title' => "這是一把不能裝子彈的武器。",),
	'P' => Array('title' => "高概率將毆系對你的物理傷害減半。",),
	'p' => Array('title' => "攻擊對手時，將產生額外的毒屬性傷害。也有可能讓對手陷入中毒異常狀態。",),
	'q' => Array('title' => "高概率將毒屬性對你的屬性傷害減半。並避免中毒狀態。",),
	'R' => Array('title' => "這把武器造成的傷害與消耗的耐久為隨機值。",),
	'r' => Array('title' => "根據你的熟練度，做出一定數量的連續攻擊。",),
	'S' => Array('title' => "槍支類武器開火時不會產生聲音。",),
	's' => Array('title' => "這個物品是遊戲王同調合成的必備素材。",),
	'U' => Array('title' => "高概率將火焰屬性對你的屬性傷害減半。並避免燒傷狀態。",),
	'u' => Array('title' => "攻擊對手時，將產生額外的火焰屬性傷害。也有可能讓對手陷入燒傷狀態。",),
	'V' => Array('title' => "裝備或拾取帶有詛咒屬性的物品時，無法將其丟棄、贈予或存入容器。\n持有詛咒道具時，可能會在探索中遭遇不測……",),
	'v' => Array('title' => "丟棄本物品，或你死亡時，本物品會消失。",),
	'W' => Array('title' => "高概率將音波屬性對你的屬性傷害減半。並避免混亂狀態。",),
	'w' => Array('title' => "攻擊對手時，將產生額外的音波屬性傷害。也有可能讓對手陷入混亂異常狀態。",),
	'X' => Array('title' => "可能會一擊必殺。",),
	'x' => Array('title' => "人類，可以挑戰神麼？"),
	'y' => Array('title' => "攻擊對手時，一定幾率無效屬性抹消類與屬性防禦類屬性，並增加讓對手陷入異常狀態的概率。",),
	'Z' => Array('title' => "該物品可以使用特定物品進行強化。",),
	'z' => Array('title' => "那麼，這個有什麼用呢……？",),
	'-' => Array('title' => "戰鬥時無效雙方的防具效果。",),
	'*' => Array('title' => "戰鬥時無效雙方的武器·飾品效果，並大幅度降低靈系傷害。",),
	'+' => Array('title' => "戰鬥時大幅度向低修正雙方的熟練度。",),
	'^' => Array('title' => "裝備後，可使用「揹包」相關指令存儲物品。",),
	'🧰' => Array('title' => "將帶有該屬性的物品用作某些合成的素材時，可以重複利用。",),
);


?>
