<?php
if(!defined('IN_GAME')) exit('Access Denied');

#幻想世界相关配置文件
//看板娘头像链接：
$vnworld_img = 'img/Crimzonnews.gif';
//看板娘文本：
$vnworld_notice = "喔！年輕人呦！你發現了一個不得了的地方呢！<br>
……你問我為什麼在這裏？……其實我也只是臨時在這兒代個班而已。<br>
總之，在這裏的員工回來之前，就請你自己先隨便逛逛吧。<br>";

#玩家自定义合成相关：

//是否开启道具名的联想输入列表：（默认：1=开启）
$vnmix_name_assoc = 1;
//编辑或审批提交的合成列表需要的最低权限等级：（默认：5级）
$vnmix_editor_group = 5;
//提交一次合成需要消耗的切糕：（默认：200。0为不消耗）
$vnmix_c2_cost = 200;
//自定义合成最多可以添加几个属性（最多不能超过30个，默认：7个）
$vnmix_max_sk = 7;
//允许普通玩家选择的道具类别
$vn_iteminfo = Array
(
	'Ag' => '同志飾物',
	'Al' => '熱戀飾物',
	'A'  => '飾物（無屬性）',
	'Ac'  => '飾物（重擊輔助）',
	'B' => '電池',
	'Ca' => '藥劑（全恢復）',
	'Ce' => '藥劑（治療麻痹）',
	'Ci' => '藥劑（治療凍結）',
	'Cp' => '藥劑（治療中毒）',
	'Cu' => '藥劑（治療燒傷）',
	'Cw' => '藥劑（治療混亂）',
	'DB' => '身體裝備',
	'DH' => '頭部裝備',
	'DA' => '手臂裝備',
	'DF' => '腿部裝備',
	'EE' => '電腦設備',
	'HH' => '生命恢復',
	'HS' => '體力恢復',
	'HB' => '命體恢復',
	'HM' => '歌魂增加',
	'HT' => '歌魂恢復',
	'GBr' => '機槍彈藥',
	'GBi' => '氣體彈藥',
	'GBh' => '重型彈藥',
	'GBe' => '能源彈藥',
	'GB' => '手槍彈藥',	
	'MA'=> '攻擊力強化藥物',
	'MD'=> '防禦力強化藥物',
	'ME'=> '經驗強化藥物',
	'MH'=> '生命強化藥物',
	'MS'=> '體力強化藥物',
	'PM' => '歌魂增加（有毒）',
	'PT' => '歌魂恢復（有毒）',
	'PH' => '生命恢復（有毒）',
	'PS' => '體力恢復（有毒）',
	'PB' => '命體恢復（有毒）',
	'PB2' => '命體恢復（劇毒）',
	'VP'=> '毆系技能書籍',
	'VK'=> '斬系技能書籍',
	'VC'=> '投系技能書籍',
	'VG'=> '射系技能書籍',
	'VD'=> '爆系技能書籍',
	'VF'=> '靈系技能書籍',
	'VV'=> '全系技能書籍',
	'ss' => '歌詞卡片',
	'TN' => '陷阱',
	'U' => '掃雷設備',
	'WGK' => '槍刃',#射+斩
	'WCF' => '符札',#投+符
	'WCP' => '重物',#投+殴
	'WKF' => '靈刃',#斩+符
	'WKP' => '重劍',#斩+殴
	'WFK' => '魔刃',#符+斩
	'WDG' => '巨炮',#爆+射
	'WDF' => '落魂',#爆+符
	'WJ' => '重型槍械',
	'WP' => '鈍器',
	'WG' => '遠程兵器',
	'WK' => '鋭器',
	#鹅鹅鹅鹅鹅鹅鹅
	'WC01' => '投擲兵器(★1)',
	'WC02' => '投擲兵器(★2)',
	'WC03' => '投擲兵器(★3)',
	'WC04' => '投擲兵器(★4)',
	'WC05' => '投擲兵器(★5)',
	'WC06' => '投擲兵器(★6)',
	'WC07' => '投擲兵器(★7)',
	'WC08' => '投擲兵器(★8)',
	'WC09' => '投擲兵器(★9)',
	'WK01' => '遊戲王一星素材',
	'WK02' => '遊戲王兩星素材',
	'WK03' => '遊戲王三星素材',
	'WK04' => '遊戲王四星素材',
	'WK05' => '遊戲王五星素材',
	'WK09' => '遊戲王九星素材',
	'WK10' => '遊戲王十星素材',
	#鹅鹅鹅鹅鹅鹅鹅
	'WC' => '投擲兵器',
	'WD' => '爆炸物',
	'WF' => '靈力兵器',	
	'X' => '合成專用',
	'Y' => '特殊',
	'Z' => '特殊（不可合併）',
);
//允许管理员在上述基础上额外选择的道具类别
$vn_gm_iteminfo = Array
(
	'AA' => '數據護盾',
	'AB' => '毒物中和',
	'Ah'  => '飾物（傷害制御）',
	'WN'  => '空手',
	'EW' => '天氣控制',
	'ER' => '探測儀器',
	'p' => '禮物',
	'p0P' => '福袋（毆系）',
	'p0K' => '福袋（斬系）',
	'p0C' => '福袋（投系）',
	'p0G' => '福袋（射系）',
	'p0D' => '福袋（爆系）',
	'p0F' => '福袋（靈系）',
	'p0O1' => '福袋（雜項1）',
	'p00' => '超級福袋（00）',
	'p0AV' => 'VTuber大福袋',
	'fy' => '全地圖唯一的野生浮雲禮物盒',
	'ygo' => '卡包',
	'XA' =>'代碼殘片·綠',
	'XB' =>'代碼殘片·紫',
	'XC' =>'代碼殘片·黃',
	'XX' =>'殺意已決',
	'XY' =>'殺意未決',
	'ZA' => '代碼漏洞',
	'ZB'=> '稱號卡',
);
//允许普通玩家选择的合成属性
$vn_itemspkinfo = Array
(
	'none' => '無',
	'A' => '全系防禦',
	'a' => '屬性防禦',
	'B' => '傷害抹消',
	'b' => '屬性抹消',
	'C' => '防投',
	'c' => '重擊輔助',
	'D' => '防爆',
	'd' => '爆炸',
	'E' => '絕緣',
	'e' => '電擊',	
	'F' => '防符',
	'f' => '灼焰',
	'G' => '防彈',
	'g' => '同志',
	'H' => 'HP制御',
	'h' => '傷害制御',
	'I' => '防凍',
	'i' => '凍氣',
	'j' => '多重',
	'J' => '超量素材',
	'K' => '防斬',
	'k' => '冰華',
	'l' => '熱戀',
	'M' => '陷阱探測',
	'm' => '陷阱迎擊',
	'N' => '衝擊',
	'n' => '貫穿',
	'y' => '破格',
	'o' => '一發',
	'P' => '防毆',
	'p' => '帶毒',
	'q' => '防毒',
	'R' => '混沌',
	'r' => '連擊',
	'S' => '消音',
	's' => '調整',
	'U' => '防火',
	'u' => '火焰',
	'v' => '靈魂綁定',
	'W' => '隔音',
	'w' => '音波',
	'X' => '直死', //NPC专用
	'x' => '奇蹟',
	'Z' => '菁英',
	'z' => '天然',
	'^' => '揹包',
);
//允许管理员在上述基础上额外选择的属性
$vn_gm_itemspkinfo = Array
(
	//'L' => '致残',
	'-' => '精神抽取',
	'*' => '靈魂抽取',
	'+' => '技能抽取',
	//0-99数字做在这里面还是再开一个框？要考虑考虑。
	'1' => '編號1',
	'2' => '編號2',
	'3' => '編號3',
	'4' => '編號4',
	'5' => '編號5',
	'6' => '編號6',
	'7' => '編號7',
	'8' => '編號8',
	'9' => '編號9',
	'10' => '編號10',
	'11' => '編號11',
	'12' => '編號12',
	'13' => '編號13',
	'14' => '編號14',
	'15' => '編號15',
	'16' => '編號16',
	'17' => '編號17',
	'95' => '編號95',
	'96' => '編號96',
	'97' => '編號97',
	'98' => '編號98',
	'99' => '編號99',
);
//道具组别
$vrclassinfo = Array
(
	'wp'=> array('毆系武器','yellow'),
	'wk'=> array('斬系武器','yellow'),
	'wg'=> array('射系武器','yellow'),
	'wc'=> array('投系武器','yellow'),
	'wd'=> array('爆系武器','yellow'),
	'wf'=> array('靈系武器','yellow'),
	'wmu' => array('多重武器','yellow'),
	'w' => array('其他裝備','yellow'),
	'h' => array('補給品','lime'),
	'pokemon'=> array('小黃系道具','yellow'),
	'fseed'=> array('種火系道具','lime'),
	'ocg'=> array('遊戲王系道具','clan'),
	'key'=> array('KEY系道具','lime'),
	'cube'=> array('方塊系道具','yellow'),
	'item'=> array('其他道具','yellow'),
	'titles'=> array('頭銜獎勵相關道具','sienna'),
);
//显示在编辑合成页面上方的信息
$vnmix_top_tips = '提示：每個配方至少需要兩種合成素材，素材與道具名最長不可以超過30個字符。<br>將道具耐久設置為0時可以讓耐久度變為“∞”。';
if($vnmix_c2_cost) $vnmix_top_tips.='每次提交需要消耗'.$vnmix_c2_cost.'份切糕。';
//显示在编辑合成与打印合成表页面上的提示信息
$check_tips = Array('<span class="yellow">提交中</span>','<span class="lime">已採納</span>','<span class="red">未採納</span>');
$check_infos = Array
(
	0 =>'<span class="yellow">成功保存了配方！</span><br>',
	1 =>'<span class="yellow">成功編輯了配方！</span><br>',
	2 =>'<span class="red">刪除了配方。</span><br>',
	3 =>'<span class="yellow">採納了配方！</span><br>',
	4 =>'<span class="red">將配方狀態變更為未採納。</span><br>',
);

?>
